[
    {
        "name": "Arrax",
        "hatched": "In 115 – 120 AC.",
        "died": "In 129 AC, Shipbreaker Bay.",
        "rider": "Lucerys Velaryon.",
        "colors": "Pearlescent white, Gold (chest and eyes), Yellow (flame).",
        "discription": "Arrax's color is not stated in the published texts. However, the artist commissioned for the 2021 A Song of Ice and Fire Calendar, Sam Hogg, asked for clarification from George R. R. Martin's team, and was told that Arrax's coloration was pearlescent white with yellow flame, golden eyes and a golden chest. At the outbreak of the Dance of the Dragons, Arrax was mature enough to be ridden, but still young and growing. He was five times smaller than Vhagar.",
        "history": "Princess Rhaenyra Targaryen's three eldest sons by her husband, Ser Laenor Velaryon, were Jacaerys (b. 114 AC), Lucerys (b. 115 AC), and Joffrey (b. 117 AC). The greens, the rival faction at court who supported Rhaenyra's stepmother Alicent Hightower and her children, spread the accusation that Rhaenyra's three sons were not really Laenor's, but bastards fathered by Ser Harwin Strong. In an effort to confirm that he considered Rhaenyra and her sons the true heirs to the throne, her father King Viserys I Targaryen decreed that a dragon egg would be put in the cradle of each of the boys, to bond with the dragons that hatched from them. Those who doubted the paternity of Rhaenyra's sons also doubted that the eggs would ever hatch, but they were quickly disappointed, as each of the eggs soon hatched in turn. The hatchlings were named Vermax (bonded with Jacaerys), Arrax (bonded with Lucerys), and Tyraxes (bonded with Joffrey). The exact date each hatched is not known, but the last seems to have hatched by no later than about 120 AC. At the start of the civil war between Queen Rhaenyra and her half brother, King Aegon II Targaryen, Lucerys was thirteen years old, and his dragon Arrax was thriving and growing every year. At Rhaenyra's first black council on Dragonstone, Lucerys and his brother Jacaerys volunteered to serve as her envoys to the lords of Westeros to raise support for her claim, and to show their legitimacy as Targaryens by riding on dragons. Rhaenyra allowed this, but she first made her young sons swear on The Seven-Pointed Star that they would not take part in any fighting. Prince Jacaerys flew north as a messenger on Vermax. Prince Lucerys, as the younger son, was sent on a mission that was considered shorter and safer than his brother Jacaerys's, flying on Arrax as a messenger to Storm's End, where it was expected that Lord Borros Baratheon would give him a warm welcome. Lucerys and Arrax arrived at Storm's End before a gathering storm, and discovered that Prince Aemond Targaryen, an emissary for his brother, King Aegon II, had already arrived on Vhagar, to acquire Borros's allegiance. Lucerys could not match Aemond's offer, and Borros rejected Rhaenyra's attempt at alliance. However, before Lucerys could leave, he was challenged by Aemond, who insisted that Lucerys put out his own eye to repay him for the eye Aemond had lost in a fight with Lucerys years before. However, Lucerys refused, telling him he came as an envoy, not a knight, but Aemond demanded Luke's eye or his life. At this, Lord Borros intervened, not wanting the blood of envoys to be shed under his roof, and his guards escorted Lucerys back to the castle yard where Arrax waited amidst a terrible storm. When Borros's daughter Maris taunted Aemond, asking him if Lucerys had removed his balls as well as his eye, Aemond became enraged. When he asked Borros's leave to go, Borros told Aemond that he had no say about what he did while not underneath Borros's roof, and allowed him to depart. As Aemond mounted Vhagar and went after Luke, Arrax was struggling to stay aloft in the storm. Arrax was younger and swifter, and on a calm day might have been able to outfly his pursuer, but the weather impeded him, and Vhagar was five times the size of her foe and the hardened survivor of a hundred battles. The two dragons met above Shipbreaker Bay. According to Archmaester Gyldayn, if there was a fight, it could not have lasted long. Watchers on the walls of Storm's End saw distant blasts of flame, and heard a shriek louder than the thunder. Then the two dragons were locked together, as lightning crackled around them. The fight ended when Arrax fell, broken, to be swallowed by the storm-lashed waters of the bay. Arrax's head and neck washed up beneath the cliffs below Storm's End three days later. Prince Lucerys's body was never found. Gyldayn notes that some claim that Vhagar snatched Lucerys off Arrax's back and swallowed him whole. Some have even claimed that Luke survived his fall and swam to safety, but lost all memory of who he was, spending the rest of his days as a simpleminded fisherman. But more legitimate historians such as Munkun disregard such tales, and state that Lucerys died with his dragon.",
        "image": "/images/Arrax.jpg"
    },
    {
        "name": "Balerion",
        "hatched": "In or before 114 BC, Valyria.",
        "died": "In 94 AC.",
        "rider": "Aegon I Targaryen, Maegor I Targaryen, Aerea Targaryen, Viserys I Targaryen.",
        "colors": "Black (scales and wings), Black with swirls of red (flame).",
        "discription": "Balerion, called the Black Dread, was a dragon of House Targaryen. He was ridden by King Aegon I Targaryen during the Conquest, alongside his sister Queen Visenya's Vhagar, and his sister Queen Rhaenys's Meraxes. Other known riders of Balerion were King Maegor I Targaryen, Princess Aerea Targaryen and Prince Viserys Targaryen. Balerion died of old age in 94 AC during the reign of King Jaehaerys I Targaryen, more than two hundred years old. Balerion was the largest of all the Targaryen dragons since Aegon's Conquest. His wingspan was so large that his shadow could engulf entire towns when he passed overhead. His teeth were as long as swords, and his jaws were large enough to swallow an aurochs whole, or even one of the hairy mammoths that are said to roam the cold wastes beyond the Port of Ibben. By 93 AC, Balerion had finally stopped growing. He had grown sluggish and heavy and was difficult to rouse. When Prince Viserys Targaryen claimed the dragon that year, the dragon struggled to take to the air. Prince Viserys believed the dragon no longer had the strength to fly from King's Landing to Dragonstone. Balerion was willful, and not a beast to trifle with.",
        "history": "Balerion was named after an ancient god of the Valyrian Freehold. He was born in Valyria, and was one of the five dragons Aenar Targaryen brought with him when he fled to Dragonstone to survive the Doom of Valyria. After the other four of Aenar's dragons died, Balerion became the last creature to have seen the Freehold in its prime, Balerion was eventually claimed by Lord Aegon Targaryen, some time before he married his sisters Visenya and Rhaenys. Aegon became involved in the wars in the Disputed Lands when Pentos and Tyrosh approached him, inviting him to join a grand alliance against Volantis, and he chose to heed their call. Mounting Balerion, he flew east to meet the Prince of Pentos and the magisters of the Free City, then flew to Lys in time to set ablaze a Volantene fleet trying to take the city. Afterwards, Aegon turned his attention to conquering the Seven Kingdoms, during which he flew on Balerion. Aegon descended on Lords Mooton and Darklyn, killing both of them during Aegon's first test. After the ironborn victory at the Wailing Willows, Balerion burned the victors on the Gods Eye. Next, Aegon took Balerion to Harrenhal, where Harren Hoare, King of the Isles and the Rivers, had taken refuge in his formidable fortress. When Harren the Black had not yielded by sunset, Aegon took Balerion high up and descended inside the castle walls, putting the new castle to flame. Balerion's dragonfire burned so hot that the towers of Harrenhal went up like candles, melting and twisting into the shapes they retain to this day. King Harren and his remaining sons all perished, ending the line of House Hoare. The men of Crackclaw Point quickly surrendered to Visenya after learning of the burning of Harrenhal. Aegon next rode Balerion in the Field of Fire, besides his sisters on Vhagar and Meraxes. Between the three dragons, four thousand men were burned to death, including Mern IX Gardener, King of the Reach, resulting in Targaryen victory. When Aegon learned that Torrhen Stark, King in the North, had crossed the Neck and was leading an army into the riverlands, he raced ahead of his army on Balerion to meet the threat. When the Targaryen host was encamped at one side of the Trident and the northern host on the other side, Torrhen's bastard brother, Brandon Snow, offered to assassinate the sleeping dragons. Recalling the destruction the three dragons had caused at the Field of Fire, Torrhen instead submitted to Aegon. After Aegon was crowned by the High Septon, he was cheered by tens of thousands of onlookers as he flew on Balerion through the streets of Oldtown. According to song, at the end of the war Balerion helped to forge the Iron Throne by melting the swords of Aegon's fallen enemies. In 2 AC, Aegon flew his dragon to the Iron Islands to end the succession struggle among the ironborn. Aegon flew Balerion during the First Dornish War, finding Sunspear abandoned when he arrived. Dorne rose in rebellion after he departed, however, and Lord Orys Baratheon was mutilated by the Wyl of Wyl. Aegon retaliated by burning several of House Wyl's keeps, and the king later attacked Sandstone, Vaith, and the Hellholt with the aid of Visenya. Aegon burned Skyreach after House Fowler attacked Nightsong. During the two years of the Dragon's Wroth following the death of Rhaenys Targaryen, each Dornish castle (with the exception of Sunspear) was burned multiple times by the vengeful Aegon and Visenya. King Aegon made frequent royal progresses throughout the Seven Kingdoms. Besides allowing the new monarch to learn more about his subjects, the sight of Balerion during these visits also helped to prevent rebellion. King Maegor I Targaryen and Balerion burn the Sept of Remembrance, by Jordi Gonzalez for The World of Ice & Fire.After the death of King Aegon I Targaryen, Balerion was claimed by his younger son, Prince Maegor, who had long coveted his father's mount, and had not claimed another dragon because he considered all others unworthy. After Jonos Arryn imprisoned his brother Ronnel, Lord of the Eyrie, and declared himself independent of the Iron Throne, Maegor rode the Black Dread to the Vale of Arryn and put down his rebellion, When Maegor was exiled to Pentos as punishment for his polygamous marriage, he took Balerion with him. After the death of his elder brother, King Aenys I, Maegor flew back to Westeros on Balerion to claim the Iron Throne, During the Faith Militant uprising, King Maegor used Balerion in the burning of the Sept of Remembrance and in the battle at the Great Fork of the Blackwater Rush. In the westerlands, the king burned the seats of Houses Broome, Doggett, Falwell, and Lorch. Maegor threatened to attack Oldtown as well, but the city opened its gates to the king after the unexpected death of the High Septon. In the Battle Beneath the Gods Eye, Maegor used Balerion to kill his nephew Prince Aegon and his dragon Quicksilver. After the completion of the Red Keep, Maegor began construction of the Dragonpit to house Balerion, Vhagar, and other dragons, After Maegor's death, Balerion returned to Dragonstone, In late 54 AC, Princess Aerea Targaryen claimed Balerion from the yard of Dragonstone one morning. They disappeared and went missing for more than a year. King Jaehaerys I Targaryen sent expeditions to try and locate Balerion and the young princess, and the master of coin, Rego Draz, offered a reward for any information on their whereabouts, but none came forward that were credible. Balerion was the largest living dragon in the world, but there were no sightings of the dragon anywhere. Septon Barth believed that the lack of sightings suggested that Balerion was no longer in Westeros. Rhaena Targaryen departed on Dreamfyre to search for Balerion and her missing daughter, Balerion returned to King's Landing in 56 AC, descending into the courtyard of the Red Keep with Aerea barely clinging to him. The princess was severely ill, and died soon after. Barth's accounts describe wounds and half-healed scars on Balerion. The dragon bore a huge jagged rent down his left side, almost nine feet long, and fresh blood still dripped from the wound, hot and smoking. Barth speculated that, when Aerea claimed Balerion, she was unable to bend the dragon to her will, and instead the dragon had taken her to the place he had been born, Valyria. Shortly thereafter, Balerion became the first dragon to be housed in the Dragonpit, where he was guarded by the Dragonkeepers, Prince Baelon Targaryen smacked Balerion on his snout the first time the boy entered the Dragonpit. When Princess Alyssa Targaryen came to the Dragonpit to claim a dragon of her own in 75 AC, the Dragonkeepers persuaded her not to try and claim Balerion, insisting that the dragon had become old and slow, suggesting to her that she would much more prefer a faster dragon, The last rider of Balerion was Prince Viserys Targaryen, who entered the Dragonpit to claim the dragon in 93 AC. Balerion was hard to rouse, and struggled when Viserys urged him into the sky. They flew around King's Landing three times, although Viserys later confided to his father that he had originally intended to fly Balerion to Dragonstone. However, fearing the dragon lacked the strength to do so, Viserys had opted otherwise, Balerion died in 94 AC, less than a year after Viserys claimed him as his mount, Princess Rhaenys Targaryen named her black kitten after Balerion, and the girl often pretended that her cat was actually the Black Dread, Along with eighteen other Targaryen dragon skulls, Balerion's skull hung on a wall in the Red Keep's throne room. After Robert's Rebellion, King Robert I Baratheon had the skulls removed from the throne room and stored them in a dank cellar. In 284 AC, when Tyrion Lannister visited the capital for the wedding of his sister Cersei to Robert, he observed the skulls in the cellar, including Balerion's.",
        "image": "/images/Balerion.jpg"
    },
    {
        "name": "Cannibal",
        "hatched": "In or before 114 BC, Dragonstone.",
        "died": "Some time after the end of the Dance, the Cannibal vanished.",
        "rider": "None.",
        "colors": "Coal black, Green (eyes).",
        "discription": "The Cannibal was a wild dragon that lived on Dragonstone during the Dance of the Dragons, Was black as coal, with menacing green eyes. He was the largest and oldest of the three completely wild dragons dwelling on Dragonstone.",
        "history": "The Cannibal's exact age has not yet been stated. The wild dragon Sheepstealer is said to have hatched when the Old King was still young, which could be in the early years of reign of Jaehaerys I Targaryen or, more generally, during his youth, and Cannibal is said to have been the eldest and largest of the wild dragons having taken part in the Sowing, being therefore even older than Sheepstealer. Some among the small folk of Dragonstone claimed that the Cannibal lived on the island even before the Targaryens arrived in 114 BC, a possibility that would make him, despite his size not being considered bigger than that of Vhagar and Vermithor, the oldest living dragon in Westeros at the time of the Dance of the Dragons, even older than Vhagar. If the Cannibal was from a different lineage of dragons altogether, that might also have explained why it was so antagonistic to the other Targaryen dragons. However, Grand Maester Munkun and Septon Eustace doubt these claims. The Cannibal was known to attack smaller dragons. He laired at the back of the Dragonmont, on its eastern side. Prior to the Dance of the Dragons, would-be dragontamers had made attempts to ride him a dozen times, and his lair was littered with their bones. When Prince Jacaerys Velaryon called for dragonriders in 129 AC, none of the dragonseeds who attempted to tame the wild dragons were foolish enough to disturb the Cannibal due to his reputation - and any who were, did not return to tell the tale. However, when Silver Denys tried to master Sheepstealer, the dragon tore off his arm. As his sons struggled to stanch his wound, the Cannibal descended on them, drove off Sheepstealer, and devoured Silver Denys and his sons. In 130 AC, when the carcass of the Grey Ghost was discovered at the Dragonmont's base, burned and broken, torn apart and partially devoured, Dragonstone's castellan Ser Robert Quince was quick to name the Cannibal as the killer (though in truth it was actually Sunfyre). Some fisherfolk began to worry that the dragon would attack them as well, and urged Ser Robert to send knights to kill the Cannibal. He refused, reasoning that if they left the dragon alone he would not bother them, and forbade fishing in the waters to the east of the Dragonmont, where Grey Ghost's body had been found. However, Lady Baela Targaryen was not satisfied with this explanation, and proposed to discover the truth herself, as she had no fear of the Cannibal and her dragon Moondancer could outfly him. But Ser Robert barred her from taking the risk, and confined Baela to her chambers. The Cannibal was one of the four dragons that survived the Dance of the Dragons. In 132 AC, it was said that during the burial at sea of Lord Corlys Velaryon, the Cannibal took wing and flew to salute the deceased. However, Archmaester Gyldayn notes this may be a later embellishment of the story, since the Cannibal would be more likely to eat the corpse than salute it.",
        "image": "/images/Cannibal.jpg"
    },
    {
        "name": "Caraxes",
        "hatched": "In or before 72 AC, Dragonstone.",
        "died": "In 130 AC, the Gods Eye.",
        "rider": "Aemon Targaryen, Daemon Targaryen.",
        "colors": "Red scales, Yellow eyes.",
        "discription": "Caraxes was red, huge, and lean. In battle he was formidable, fearsome, and experienced. By the end of his life, Caraxes was considered an old and cunning dragon.",
        "history": "It is unknown when Caraxes hatched from his egg but by 72 AC he was a young dragon of rideable size. That year, Aemon Targaryen, Prince of Dragonstone and heir apparent of the Iron Throne, claimed Caraxes for the first time. The Dragonkeepers considered him to be the fiercest of all the young dragons of the Dragonpit and nicknamed him the 'Blood Wyrm'. The Targaryen siblings Alyssa, Baelon and Aemon liked to fly together on their dragons (Meleys, Vhagar, and Caraxes respectively). Aemon used Caraxes against the Dornish fleet during the Fourth Dornish War in 83 AC. When rogue Myrmen invaded parts of the island of Tarth in 92 AC, Aemon flew to the island on Caraxes's back to help lords Cameron Tarth and Boremund Baratheon fight back the invaders. Caraxes easily outdistanced the Velaryon fleet led by Lord Corlys Velaryon in the process. Caraxes was eating goats when Prince Aemon was killed by a crossbow bolt in the throat. By 105 AC, Aemon's nephew, Prince Daemon Targaryen, had claimed Caraxes as his mount. Daemon took his paramour Mysaria with him on Caraxes when he retreated from King's Landing for Dragonstone. Daemon used Caraxes during the War for the Stepstones (106–115 AC). During those years, Daemon divided his time between the Stepstones and Dragonstone where he would often fly with his niece, Princess Rhaenyra, and her dragon Syrax. After Daemon remarried to Lady Laena Velaryon, the newly wed toured the Free Cities of Essos with their dragons Caraxes and Vhagar. Huge crowds came to see both dragons everywhere they went. At the start of the Dance of the Dragons, Daemon landed Caraxes a top Kingspyre Tower during the assault on Harrenhal. Atop Caraxes later in the civil war, Daemon challenged Aemond Targaryen and Vhagar at Harrenhal. All four were killed in the ensuing Battle Above the Gods Eye. At the end of the fight, Vhagar locked with Caraxes and they fell into the Gods Eye. While in freefall, even as Vhagar's claws opened up Caraxes's belly and used her teeth to tear off one of his wing-arms, Caraxes locked his teeth onto the larger dragon's throat and tore it out. Vhagar did not survive the force of the fall. Somehow, Caraxes managed to live long enough to pull himself out of the water and onto the shore, even though his entrails were falling out and one of his arms had been torn clean off. The dragon soon died in front of the walls of Harrenhal.",
        "image": "/images/Caraxes.jpg"
    },
    {
        "name": "Dreamfyre",
        "hatched": "In or shortly before 32 AC.",
        "died": "In 130 AC, the Dragonpit.",
        "rider": "Rhaena Targaryen, Helaena Targaryen.",
        "colors": "Pale blue, with silver markings, Silver crests and pale blue wings.",
        "discription": "Dreamfyre was a slender she-dragon, By 35 AC, Dreamfyre was large enough for the twelve-year-old Rhaena Targaryen to mount her.",
        "history": "Dreamfyre was hatched during the reign of King Aegon I Targaryen. As a hatchling, she bonded with nine-year old Princess Rhaena Targaryen, Aegon I's first grandchild, in 32 AC. Three years later, she became Dreamfyre's rider. In 41 AC Rhaena was wed to her brother, Aegon, and sent on a royal progress by their father King Aenys I Targaryen. Rhaena wished to take Dreamfyre with her, but her father forbade it, as Aegon had not yet claimed a dragon, and the king did not want his son to be seen riding a horse, while his wife rode a dragon. Dreamfyre remained in King's Landing. Rhaena's father, King Aenys, died in 42 AC and the crown was usurped by their uncle, Maegor. Rhaena and her husband smuggled themselves into King's Landing in 43 AC, while Maegor was at Oldtown. Rhaena was reunited with Dreamfyre and Aegon finally claimed a dragon of his own, his father's dragon Quicksilver. Knowing they could not hold the Iron Throne, they left King's Landing on their dragons to raise an army. When Aegon went to war against their uncle, Rhaena's and Dreamfyre did not accompany them. Aegon, along with Quicksilver, was killed in the Battle Beneath the Gods Eye by Maegor mounted on Balerion the Black Dread. Since Dreamfyre was younger and smaller than Quicksilver, many historians believe that Dreamfyre would not have been much of a threat to the Black Dread. Princess Rhaena sent her twin daughters Aerea and Rhaella into hiding. However, she felt that she could not hide herself, as she had Dreamfyre with her, who was not easily hidden. Therefore she flew Dreamfyre to Fair Isle off the coast in the Sunset Sea, where they stayed at Faircastle. There they remained until 47 AC, when Maegor commanded Rhaena to return to King's Landing. Not wanting to bring Maegor's wrath and Balerion's fires down on Fair Isle, Rhaena flew on Dreamfyre to the Red Keep, only to find out that Maegor wished to make Rhaena his bride and that his mistress of whisperers, Tyanna of the Tower, had found her daughters and used them as hostages. The next year, Rhaena fled the Red Keep upon Dreamfyre, together with her elder daughter Aerea, and Maegor's Valyrian steel sword Blackfyre, to join her only surviving brother, Jaehaerys. By 43 AC, Dreamfyre had already produced two clutches of dragon eggs. During Rhaena's second residence at Fair Isle in 49–50 AC, Dreamfyre laid another clutch of eggs. Dreamfyre's presence on the island made some of the residents anxious, and the eggs caused a begging brother to start preaching that Fair Isle would soon be overrun by dragons who would eat both sheep and men, and called for a dragonslayer to kill the dragons to prevent it. The man was arrested, but nonetheless his words inspired fear wherever they were spread. Rhaena chose to depart Fair Isle, taking Dreamfyre and the eggs with her. After some time at Casterly Rock, where Dreamfyre had been granted an entire stable, Lord Lyman Lannister expressed his interest in the three eggs and asked how they would hatch, and when that could be expected. Lady Jocasta Lannister suggested to Rhaena that gifting the Lannisters one or more of the three eggs would be a good way to demonstrate her gratitude. After Rhaena refused, Lord Lyman offered to buy the eggs. Rhaena left Casterly Rock and toured the westerlands, but many Western lords desired a dragon of their own, and she grew uncomfortable with how they looked at Dreamfyre or her eggs. In 51 AC Rhaena visited King's Landing upon Dreamfyre to attend the second wedding of her siblings King Jaehaerys and Queen Alysanne, and explained her difficulties. Rhaena was eventually granted Dragonstone as her own seat. Dreamfyre made her lair in the dragon yards at Dragonstone, and the clutch of eggs laid at Fair Isle soon hatched. Rhaena introduced her daughter, Princess Aerea, to Dreamfyre's hatchlings, and urged her to choose one and fly.In 54 AC, Rhaena discovered her former close friend and companion, Elissa Farman, had stolen three dragon eggs from the Dragonstone hatcheries and fled to Pentos, and flew Dreamfyre to King's Landing to inform her brother King Jaehaerys of the theft. Jaehaerys made plans with Rhaena to make war with their dragons Vermithor and Dreamfyre should hatchling dragons appear anywhere in the world, though this turned out to be unnecessary. Later that year, Rhaena flew Dreamfyre to Storm's End to reconcile with her mother, Dowager Queen Alyssa Velaryon, but arrived too late for Alyssa's death in childbirth. Still within that year, Rhaena's female companions were all murdered by her husband, Androw Farman, using the tears of Lys. When his crime was discovered, Androw committed suicide by leaping from the window of the Chamber of the Painted Table; Rhaena had his body hacked to pieces and fed to Dreamfyre and the other dragons of Dragonstone. Near the end of 54 AC, Rhaena discovered that her daughter Aerea had mounted Balerion and fled Dragonstone. Rhaena flew Dreamfyre to the Red Keep, convinced that Aerea had gone there. Rhaena remained at court while Jaehaerys sent forth ravens across the realm, but after seven days, she declared that she was going to look for Aerea herself and left on Dreamfyre in search of her daughter.[3] For more than a year, Rhaena flew Dreamfyre all over Westeros, from Oldtown to Highgarden to Crakehall, Casterly Rock and Fair Isle, to the barrowlands and the banks of the Fever River, and as far south as the Red Mountains of Dorne and the canyons of the Torrentine. Rhaena and Dreamfyre were seen flying over the Fingers and the Mountains of the Moon, the rainwood on Cape Wrath, the Shield Islands, and the Arbor; however, her search was in vain. In 56 AC, while residing at Greenstone, Rhaena received a message that Princess Aerea had returned to King's Landing on Balerion. She had been infected with an insidious disease that killed her that same day. By the time the raven carrying the news had reached Rhaena, Aerea had already been cremated. Rhaena returned to King's Landing and took possession of her daughter's ashes. Refusing Jaehaerys's offer to have Aerea's ashes interred on Dragonstone as Aerea had hated living there, Rhaena instead took the ashes into the sky upon Dreamfyre and released them into the wind, claiming that Aerea had wanted to fly. Rhaena went into self-imposed isolation at Harrenhal after her daughter's death. Although she still frequently rode Dreamfyre, she wished to be left alone. Dreamfyre remained at Harrenhal with Rhaena until her death in 73 AC, after which Dreamfyre made her lair in the Dragonpit at King's Landing. During the reign of King Viserys I Targaryen, Dreamfyre bonded with Princess Helaena Targaryen. Helaena was riding Dreamfyre by age eleven,[8] and the dragon was beloved to her. During the Dance of the Dragons, after Helaena's six-year old son was slain during the civil war, Helaena spent her days in darkness, weeping, and was not capable of riding Dreamfyre anymore. Dreamfyre resided in the Dragonpit, and it is said that when Helaena threw herself to her death from her window in Maegor's Holdfast, Dreamfyre rose suddenly with a roar that shook the Dragonpit and snapped two of the chains that bound her. Dreamfyre cracks the dome of the Dragonpit during the Storming of the Dragonpit, as depicted by Douglas Wheatley in Fire & Blood. Dreamfyre remained chained in the Dragonpit when the people of King's Landing stormed the pit. Out of the four dragons present, Dreamfyre was the only dragon able to break free of her chains when the mob broke in. She took wing, circled the cavernous interior of the dome and swooped down to attack the men below. She slew more men than the other three dragons combined. Archers and crossbowmen loosed arrows and quarrels at the her, and whenever she landed men swarmed her to attack, driving her back into the air. Eventually one of her eyes was nicked by a crossbow bolt. Half-blind and maddened, Dreamfyre flew into the Dragonpit's great dome above, which cracked on impact. Half of it came tumbling down, crushing her and the dragonslayers under tons of broken stone and rubble.",
        "image": "/images/Dreamfyre.jpg"
    },
    {
        "name": "Drogon",
        "hatched": "In 299 AC, Dothraki sea.",
        "died": "Alive.",
        "rider": "Daenerys Targaryen.",
        "colors": "Black with streaks of red or black (scales), Red (eyes, horns, and spinal plates), Red or black (wings), Black shot with red (flame), Black (blood).",
        "discription": "Drogon is one of the three dragons born in the Dothraki sea to Daenerys Targaryen. He is named after her late husband, Khal Drogo. Drogon is believed by some to be the reincarnation of Balerion the Black Dread, but Daenerys decides to give him a new name for his new life, As of mid-300 AC, Drogon has grown large in the wild; his wings stretch twenty feet from tip-to-tip, black as jet, Drogon is the largest and most aggressive of Daenerys's three dragons, the fiercest and wildest. She has problems reining him in. After a hunt, when Drogon is full of food, he likes to bask in the sun.",
        "history": "At the wedding of Daenerys Targaryen to Khal Drogo, she receives multiple bride gifts, including three petrified dragon eggs from Magister Illyrio Mopatis. Drogon's egg is black as the midnight sea, alive with scarlet ripples and swirls. The maegi Mirri Maz Duur proclaims that only death can pay for life. After Khal Drogo's death, Daenerys burns his body, with Mirri Maz Duur and the three eggs on his pyre. When Daenerys hears the crack of the dragon eggs hatching, she walks into the inferno. In the flames, Drogon hatches, along with his brothers, Viserion and Rhaegal, the first dragons born in a century and a half, In the Red Waste, Daenerys names the black dragon Drogon, after her husband Khal Drogo. She learns that the dragons, no larger than scrawny cats, will only eat cooked meat, As Daenerys travels westward on the Summer Sea, bold Drogon is the first of her dragons to fly above the water, flapping from ship to ship. He is also the first to kill, flaming fish as they leap out of the water, snatching them up, and eating them. The dragons are now about the size of a small dog, Drogon slightly larger than the other two. In order to pay for all Unsullied in Astapor, Daenerys agrees to sell Drogon to the Good Masters. However, once she has received the Unsullied, Drogon refuses to go with Kraznys mo Nakloz. Daenerys tells the masters that a dragon is no slave, and with her command Dracarys, Drogon looses his flame in Kraznys's face. Daenerys then commands the Unsullied to attack their former masters, and Drogon and the other dragons join in with the destruction, As Queen of Meereen, Daenerys frequently receives petitioners asking for repayment for the sheep that her dragons have killed and eaten. Drogon particularly files far from Meereen, and can easily devour a sheep a day. A man appears before Queen Daenerys in her audience chamber, carrying a sack of burned and cracked bones, claiming they are the remains of his child Hazzea, and that the black one, the winged shadow had killed and eaten her, Horrified, Daenerys orders all three dragons to be captured and imprisoned. Viserion and Rhaegal are eventually chained (though not without cost) in a makeshift dragon pit in the Great Pyramid. Though the bravest of Daenerys's men try to capture Drogon three times, Drogon escapes their attempts, burning most of the men and killing four. He disappears, last seen flying north toward the Dothraki sea. When the fighting pits of Meereen are re-opened, Drogon appears above Daznak's Pit, drawn by the noise and smell of blood. Always the largest of Daenerys's three dragons, in the wild he has grown even larger, his wings now measuring twenty feet across. Drogon descends into the pit and kills the boar that had just killed Barsena Blackhair, and begins to devour both corpses. He sets much of the arena ablaze once provoked, and causes chaos and carnage as the citizens flee and trample one another. An animal handler named Harghaz attacks Drogon with a long spear, and comes close to slaying him. When Drogon is impaled by the spear, he and Daenerys scream as one. Drogon kills Harghaz, tearing his arm off. When her husband, Hizdahr zo Loraq, shouts for his men to kill Drogon, Daenerys leaps into the pit, running to her child. Daenerys manages to use a whip to make Drogon obey her, though with much difficulty, losing her hair and clothing when he bathes her in dragonfire. She mounts Drogon to pull the half-melted spear from his back, but after she does, he takes off. Daenerys holds on as Drogon flies away, becoming the first dragonrider in a century and a half. Drogon takes Daenerys to his lair in the Dothraki sea, a hill that she calls Dragonstone. Daenerys learns to command Drogon's flight with her whip and her words, but he refuses to return to Meereen. She attempts to walk there alone, but becomes delirious from the heat, lack of water and food, and from an illness brought on by eating green berries. In the grass, Daenerys sees a Dothraki scout, but he does not notice her, distracted by Drogon flying above. After the scout races away, Daenerys calls Drogon to her, and they fly, following the scout. Drogon kills one horse from a herd, and he and Daenerys devour it together. Afterwards, Drogon and Daenerys are discovered by Khal Jhaqo and his khalasar.",
        "image": "/images/Drogon.jpg"
    },
    {
        "name": "Grey Ghost",
        "hatched": "There is no definitive answer to when Grey Ghost was hatched in ASOIAF, as his origins remain unknown.",
        "died": "In 130 AC, Dragonstone.",
        "rider": "None.",
        "colors": "Pale grey-white, the color of morning mist.",
        "discription": "Grey Ghost, or the Grey Ghost, was th,e name given by the smallfolk of Dragonstone to a wild dragon living on the island during the Dance of the Dragons, Grey Ghost preferred to feed on fish, and was often glimpsed flying low over the narrow sea, snatching prey from the waters. He made his lair in a smoking vent high on the eastern side of the Dragonmont. He was never claimed nor ridden by any man, and was one the three wild dragons of Dragonstone, along with Sheepstealer and the Cannibal.",
        "history": "During the Dance of the Dragons, Prince Jacaerys Velaryon sought new dragonriders to fight the greens. Some of the dragonseeds looked for the Grey Ghost, but could not find him, as he was ever an elusive creature. Alyn of Hull first sought out Grey Ghost before attempting (and failing) to claim Sheepstealer. In 130 AC, the crew of the Nessaria saw Grey Ghost and another dragon fighting in the sky above the Dragonmont. Grey Ghost was slain in the struggle. When Ser Robert Quince heard of Grey Ghost's death, he wrongly assumed this was the work of the Cannibal. In truth, Grey Ghost was vanquished and partially devoured by Sunfyre upon his return to Dragonstone.",
        "image": "/images/Greyghost.jpg"
    },
    {
        "name": "The last dragon",
        "hatched": "around 129AC - 131 AC.",
        "died": "In 153 AC",
        "rider": "None.",
        "colors": "Green withered wings.",
        "discription": "The last dragon belonging to House Targaryen died young in 153 AC, during the later part of the reign of King Aegon III Targaryen, who was thereafter called the Dragonbane. Her death marked the extinction of dragons in Westeros and beyond, until Daenerys Targaryen managed to hatch three dragons around a century and a half later. lived in King's Landing. She was small and stunted, with withered wings. Her name is not known.",
        "history": "The last dragon was born to House Targaryen during the reign of King Aegon III Targaryen. Although she was sickly, she laid a clutch of five eggs, which never hatched.In 152 AC, Ser Arlan of Pennytree, then a young boy, was taken to King's Landing by his grandfather, where he saw the last dragon, as well as her eggs, which he later described as hard as stone, but beautiful. The last dragon died in 153 AC in King's Landing. Some rumors claimed that Aegon III poisoned her, as he had been afraid of dragons since the day he had seen Sunfyre, the dragon of his uncle, King Aegon II Targaryen, devour his mother, Queen Rhaenyra Targaryen. In the final years of the Targaryen dynasty, nineteen dragon skulls hung on the walls of the throne room. Two of these skulls were from the last hatchlings born on Dragonstone, and were no bigger than a mastiff's skull, and oddly misshapen. Due to the discription of the skulls, one of them may be the skull of the last Targaryen dragon. It is thought by some that magic began to leave the world the day the last dragon died. Ser Arlan believed that summers became shorter after the last dragon died, and winters longer and crueler, The last dragon was born to House Targaryen during the reign of King Aegon III Targaryen. Although she was sickly, she laid a clutch of five eggs, which never hatched. In 152 AC, Ser Arlan of Pennytree, then a young boy, was taken to King's Landing by his grandfather, where he saw the last dragon, as well as her eggs, which he later described as hard as stone, but beautiful. The last dragon died in 153 AC in King's Landing. Some rumors claimed that Aegon III poisoned her, as he had been afraid of dragons since the day he had seen Sunfyre, the dragon of his uncle, King Aegon II Targaryen, devour his mother, Queen Rhaenyra Targaryen. In the final years of the Targaryen dynasty, nineteen dragon skulls hung on the walls of the throne room. Two of these skulls were from the last hatchlings born on Dragonstone, and were no bigger than a mastiff's skull, and oddly misshapen. Due to the discription of the skulls, one of them may be the skull of the last Targaryen dragon. It is thought by some that magic began to leave the world the day the last dragon died. Ser Arlan believed that summers became shorter after the last dragon died, and winters longer and crueler.",
        "image": "/images/Lastdragon.jpg"
    },
    {
        "name": "Meleys",
        "hatched": "In before 75 AC.",
        "died": "In 129 AC, Rook's Rest.",
        "rider": "Alyssa Targaryen, Rhaenys Targaryen.",
        "colors": "Meleys had scarlet scales and pink membranes on her wings, Her crest, horns, and claws were bright as copper.",
        "discription": "Meleys, called the Red Queen, was a she-dragon ridden by Princess Alyssa Targaryen[1] and later Princess Rhaenys Targaryen.",
        "history": "By 75 AC, Meleys resided in the Dragonpit in King's Landing, never ridden before. That year, the newly married Princess Alyssa Targaryen decided to become a dragonrider. She initially wished to claim Balerion, but the dragonkeepers convinced her that he was too old and slow, and that she would prefer a swifter mount. Alyssa claimed Meleys, and afterwards rarely stayed away from the Dragonpit for long. The dragon was indeed as swift as promised, easily besting the dragons of Alyssa's brothers Aemon and Baelon when they flew together. In 77 AC, Alyssa strapped her nine-day old son Viserys to her chest and took him flying on Meleys. She did the same in 81 AC with her second son, Daemon, within a fortnight of his birth. In 84 AC, Meleys became riderless when Princess Alyssa died some time after a difficult labor. In 87 AC, Meleys was claimed by Princess Rhaenys Targaryen. In 89 AC, Rhaenys flew on Meleys to Highgarden, to accompany King Jaehaerys I Targaryen further on his royal progress to the Shield Islands. When Rhaenys married Lord Corlys Velaryon in 90 AC, she insisted on arriving to the wedding flying on Meleys. Princess Rhaenys rode Meleys during the Dance of the Dragons, on the side of Queen Rhaenyra Targaryen and the blacks, versus King Aegon II Targaryen and the greens. When the Velaryon fleet closed off the Gullet, sailing forth from Dragonstone and Driftmark to block all shipping for Blackwater Bay, the blacks' plan was for Rhaenys to fly overhead on Meleys to keep the greens from attacking the ships with their dragons. In 129 AC, when Rook's Rest was besieged by the greens' army led by Ser Criston Cole, Rhaenys flew Meleys to the castle to lend aid. During the battle at Rook's Rest, Meleys was attacked by Cole's archers and shot with iron bolts by scorpions, which angered her but did not do her harm. In response, she spat fire on the men below, and attacked the knights and horses, killing about 800 men. However, the battle proved to be a ploy when King Aegon and Prince Aemond Targaryen suddenly appeared upon Sunfyre and Vhagar above Rook's Rest. Rhaenys turned to meet the attack, despite the knowledge that Meleys had no hope of success against the two dragons. According to Archmaester Gyldayn, Meleys might have stood a chance against the older Vhagar alone, but not against Vhagar and Sunfyre combined. The dragons met violently in the air, a thousand feet above the field, with their fireballs bursting as bright as the sun. Meleys managed to close her jaw around Sunfyre's neck, just as Vhagar fell upon them, and all three dragons fell from the sky. They crashed to the ground so hard that stones fell from the battlements of Rook's Rest, half a league away. From the ashes, only Aemond and Vhagar rose unharmed. Meleys had half torn one of Sunfyre's wings off, and Aegon suffered broken ribs, a broken hip, and burns that covered half his body. Meleys did not survive the fall, and was ripped to pieces when she hit the ground. A body believed to be Rhaenys Targaryen was found beside the carcass of her dragon, so blackened that she was impossible to identify. The head of Meleys was brought back to King's Landing by the forces of King Aegon II Targaryen and drawn on a cart through the city, a display that awed the smallfolk into silence. According to Septon Eustace, thousands left King's Landing afterward, until Dowager Queen Alicent Hightower ordered the city gates closed and barred.",
        "image": "/images/Meleys.jpg"
    },
    {
        "name": "Meraxes",
        "hatched": "In 114 – 88 BC (presumably), Dragonstone.",
        "died": "In 10 AC, Hellholt.",
        "rider": "Rhaenys Targaryen.",
        "colors": "Meraxes had golden eyes and silver scales.",
        "discription": "According to Tyrion Lannister, Meraxes was larger than Vhagar but smaller than Balerion, and it is said Meraxes could swallow horses whole. However, the reliability of both claims is uncertain, since Vhagar is the only dragon described by historical sources as grown almost as big as Balerion, and Meraxes died at least several decades younger than Vhagar.",
        "history": "Meraxes was named for a god of the Valyrian Freehold. Her egg hatched on Dragonstone during the Century of Blood. At some point, Meraxes was claimed by Rhaenys Targaryen. Rhaenys first rode Meraxes, demonstrating she was a dragonrider, some time before she married her brother, Aegon. Rhaenys loved to fly, spending more time on dragonback than her brother and sister combined, and was once heard to say that she meant to fly Meraxes across the Sunset Sea to see what lay upon its western shores, After Aegon landed on Westeros and began his conquest, he dispatched his sisters to secure the submission of the nearest castles. Rosby yielded to Rhaenys and Meraxes without a fight. Afterwards, Rhaenys and Meraxes accompanied Orys Baratheon on his mission to subdue Argilac Durrandon, the last Storm King. At the Battle of the Last Storm, the wind and rain forced them to stay grounded, but even on the ground Meraxes slew many, engulfing Argilac's vanguard and the knights of his personal guard in dragonflame. Afterwards, Rhaenys flew Meraxes into the castle of Storm's End to parley with Argilac's daughter Argella. After the stormlanders submitted, Rhaenys flew Meraxes to Stoney Sept, to link up with her siblings, their dragons, and Aegon's army. They advanced south, where all three dragons took part in the decisive Field of Fire – the only battle in which all three of the Targaryen dragons took to the sky at the same time during Aegon's Conquest. Together, Meraxes, Vhagar, and Balerion killed four thousand men, burning them alive. King Mern IX Gardener died, and with him House Gardener. The army was broken, and House Targaryen was victorious. Rhaenys next flew Meraxes to the Trident in the riverlands, where she met with her brother and sister and their dragons, to face King in the North Torrhen Stark. Brandon Snow, the bastard brother of Torrhen, offered to sneak into the Targaryen camp at night to slay the dragons, but the northern king refused the attempt, and instead sent his brother as an envoy, eventually bending the knee to the Targaryens. Afterwards, Rhaenys flew Meraxes to Dorne, to demand their submission. She did not find an easy conquest, as every castle she encountered was empty and abandoned, with only women and children and old men left in the towns and villages. Finally, she and Meraxes arrived in Sunspear, where only the eighty-year-old Meria Martell, Princess of Dorne, remained. Meria told Rhaenys to inform Aegon that Dorne would neither fight nor kneel, and would have no king. Rhaenys warned Meria that the Targaryens would return, and departed Sunspear, leaving Dorne the only unconquered kingdom. The First Dornish War began in 4 AC, when Aegon decided to conquer the kingdom at last. Queen Rhaenys led the first assault on Dorne, seizing Dornish seats as she approached Sunspear, and burning the Planky Town on Meraxes. In 10 AC at Hellholt, an iron bolt from a scorpion went through Meraxes's eye, and the dragon and Rhaenys fell from the sky. In Meraxes's death throes, she destroyed the castle's highest tower and part of the curtain wall. It is not certain whether Rhaenys outlived Meraxes. There are those who say that Rhaenys lost her seat and fell to her death, while others claim that she was crushed to death beneath Meraxes in the castle yard, Following the deaths of Rhaenys and Meraxes, Visenya and Aegon burned every Dornish stronghold at least once (except Sunspear and its shadow city), during a two-year period known as the Dragon's Wroth. Meraxes's skull was later returned to Aegon by a peace delegation. Decades later, the remaining bones were still left in the open field at Hellholt. Along with eighteen other Targaryen dragon skulls, Meraxes's skull hung on a wall in the Red Keep's throne room. After Robert's Rebellion, King Robert I Baratheon had the skulls removed from the throne room, and stored them in a dank cellar. In 284 AC, when Tyrion Lannister visited the capital for the wedding of his sister Cersei to Robert, he observed the skulls in the cellar, including Meraxes's. In 298 AC, Arya Stark encountered the dragon skulls while passing through the Red Keep cellars. In 299 AC, Daenerys Targaryen had the three ships sent to her by Illyrio Mopatis renamed Vhagar, Meraxes, and Balerion, to tell the world that the dragons had returned.",
        "image": "/images/Meraxes.jpg"
    },
    {
        "name": "Moondancer",
        "hatched": "Before 120 AC (Assumed), Dragonstone.",
        "died": "In 130 AC, The fall of Dragonstone.",
        "rider": "Baela Targaryen.",
        "colors": "Slender pale green. Her horns, crest and wingbones were pearl.",
        "discription": "Moondancer was a young she-dragon, ridden by Lady Baela Targaryen.Although in 129 AC Moondancer was not yet considered large enough to carry the thirteen-year old Baela Targaryen upon her back, a year later Baela was able to mount the dragon. At the time, Moondancer was no larger than a warhorse.",
        "history": "Moondancer remained at Dragonstone with her rider, Lady Baela Targaryen, for most of the first two years of the Dance of the Dragons. Around the time of the First Battle of Tumbleton, it was noted that Baela had started riding Moondancer not half a year past, which would be around late 129 AC (whether she began before or after the Battle of Rook's Rest is unclear). In that half year, Baela trained extensively on Moondancer, riding her every day to all parts of Dragonstone. She even rode Moondancer to nearby Driftmark and back. When the corpse of the dragon Grey Ghost was sighted on the far side of the Dragonmont, it was suspected that the dragon known as the Cannibal had killed him. Baela offered to take young Moondancer to hunt him down, boldly arguing that her smaller and more nimble dragon could outmaneuver him. However, Dragonstone's castellan, Ser Robert Quince, felt it wasn't worth the risk, and had Baela confined to her chambers. Unknown at the time, Grey Ghost had not been killed by the Cannibal, but by the badly injured Sunfyre, dragon of King Aegon II Targaryen himself. Sunfyre continued to hide on the other side of the island. When Dragonstone fell to Aegon II Targaryen and his men, Baela was able to evade capture by escaping from her bedchambers as the door was being smashed down. She managed to reach Moondancer in her stable, loosed the dragon's chains, and strapped a saddle onto her. As Aegon II flew Sunfyre over Dragonmont's smoking peak, planning to land triumphantly in the courtyard of the castle, Baela and Moondancer rose up to meet them. The two dragons fought fiercely in the air. The younger, smaller Moondancer was far more nimble than the half-crippled Sunfyre, and she managed to evade his flames, jaws, and claws for a time, while at the same time wounding Sunfyre heavily on his back and malformed wing. Moondancer was blinded when a blast of Sunfyre's flames hit her directly in the eyes. Despite the fire, Moondancer advanced on Sunfyre, slamming into him and falling to the ground with him. Although both dragons survived the fall, upon the ground Moondancer's speed could not defeat Sunfyre's size and weight. The younger dragon was eventually killed by Sunfyre, who then devoured her carcass. Nonetheless, Moondancer had succeeded in mortally wounding her opponent. Sunfyre died in the last month of the year, from wounds received during the battle.",
        "image": "/images/Moondancer.jpg"
    },
    {
        "name": "Morghul",
        "hatched": "during the reign of Viserys I Targaryen (103 - 129 AC).",
        "died": "In 130 AC, the Dragonpit.",
        "rider": "Jaehaera Targaryen.",
        "colors": "Not Mentioned.",
        "discription": "Morghul was a young dragon bound to but never ridden by Princess Jaehaera Targaryen.",
        "history": "During the Dance of the Dragons, Rhaenyra Targaryen and her blacks took King's Landing from Aegon II Targaryen and his greens. Morghul's owner, Princess Jaehaera Targaryen, was successfullly spirited away from the capital, however. Morgul stayed in the Dragonpit alongside Dreamfyre, Tyraxes, Shrykos, and Seasmoke (before he fled the city with his ridder, Ser Addam Velaryon) during Rhaenyra's half-year reign over the capital. Overtime Rhaenyra's relations with the citizens of the city deteriorated to the point of riots. In one of these riots a one-handed prophet called the Shepherd began to rant against the dragons and convinced the mob of Kingslanders to go to the Dragonpit and kill them all. Despite being shackled by heavy chains, Morghul slew scores of people with its fire. A huge man in heavy armor remember as the Burning Knight is credited for killing of Morghul. It is said he thrusted his spear through Morghul's eye as the dragon bathed him with fire. Morghul died never have been ridden.",
        "image": "/images/Morghul.jpg"
    },
    {
        "name": "Morning",
        "hatched": "Between 129 - 130 AC.",
        "died": "In 136 – 153 AC.",
        "rider": "Rhaena Targaryen.",
        "colors": "Morning's scales were pale pink, but with black horns and crest.",
        "discription": "Morning was a she-dragon which hatched during the Dance of the Dragons. It belonged to Lady Rhaena Targaryen, the daughter of Prince Daemon Targaryen and Lady Laena Velaryon.",
        "history": "Morning hatched during the Dance of the Dragons from one of the three eggs that Lady Rhaena Targaryen brought with her to the Vale, a clutch produced by Rhaenyra's she-dragon Syrax. News of Morning's birth reached the greens around the start of 131 AC, greatly troubling them, as they had lost all of their dragons during the fighting. Dowager Queen Alicent Hightower feared that the smallfolk would consider the blacks as more legitimate, due to Morning's birth. The war lasted only for another half a year, during which time Morning was still too young to be ridden.Morning was one of four dragons to survive the Dance of the Dragons - and the only one still controlled by the Targaryens. Rhaena and Morning arrived in King's Landing after the death of King Aegon II Targaryen in mid-131 AC. While the smallfolk became ecstatic at the sight of Morning, Rhaena's brother, King Aegon III Targaryen, who was fearful of dragons, paled when he saw the dragon for the first time and commanded his guards to get that wretched creature out of my sight, During their time at King's Landing, Rhaena would often visit throughout the city, usually with Morning, who was still small and young, coiled about her shoulders like a stole. By the start of 134 AC, Morning had grown much and had made her lair in the Dragonpit. On the third day of the third month of 135 AC, Rhaena rode upon the back of Morning for the first time. They returned to the Dragonpit after circling once around the city, and subsequently went forth every day, flying farther each time. Rhaena landed Morning inside the Red Keep on only one occasion, where Queen Daenaera Velaryon was delighted by the dragon, but King Aegon III again refused to go and see the dragon. Shortly thereafter, Rhaena traveled on the dragon's back to Dragonstone, where, according to Rhaena, she and her dragon would be more welcome. When Rhaena's husband, Ser Corwyn Corbray, was killed in the Vale that same year, Rhaena's sister Baela traveled to Dragonstone to ensure that Rhaena would not use Morning to attempt to avenge her husband's death.When in 136 AC preparations were being made for a royal progress to he held after King Aegon III turned sixteen, Rhaena desired to accompany the progress on Morning, but this suggestion was delicately deflected by the Hand of the King and the council of regents.",
        "image": "/images/Morning.jpg"
    },
    {
        "name": "Quicksilver",
        "hatched": "In 7 AC, Dragonstone.",
        "died": "In 43 AC, south of the Gods Eye.",
        "rider": "Aenys I Targaryen, Aegon Targaryen.",
        "colors": "Coloring of her body is not stated in the books, her name as well as the coloring of her fire implies that Quicksilver's scales were silver.",
        "discription": "Quicksilver was the she-dragon of King Aenys I Targaryen and his son, Prince Aegon Targaryen, In 43 AC, Quicksilver was a quarter the size of Balerion. Her fireballs were pale white in color.",
        "history": "As a hatchling, Quicksilver bonded with infant Prince Aenys Targaryen, who had also been born in 7 AC. The health of Aenys, who had been sickly from birth, quickly improved after this. This also ended the rumors that Aenys had been fathered by someone other than King Aegon I Targaryen. Both prince and dragon thrived together, and Quicksilver became beloved to Aenys. Though Aenys loved to ride horses, Quicksilver was his favorite mount. In 23 AC, Aenys flew upon Quicksilver to Sunspear in Dorne to attend the feast held to celebrate the tenth anniversary of the peace between Dorne and the Iron Throne. Aenys succeeded his father Aegon I Targaryen as king in 37 AC. At his father's death, he was at Highgarden with Quicksilver, and flew upon the dragon to Dragonstone to attend his father's funeral. He was with Quicksilver at Riverrun when rebellions broke out later that same year. When word reached them that the outlaw called Harren the Red had killed Lord Gargon Qoherys of Harrenhal and claimed the castle for himself, Lord Tully urged Aenys to mount Quicksilver and descend on Harrenhal as Aegon I had done during the Conquest. Aenys refused. King Aenys I Targaryen died in early 42 AC. Quicksilver lit his funeral pyre at Dragonstone, and the dragons Silverwing and Vermithor added their flame to hers. Shortly thereafter, Aenys's half-brother Maegor I Targaryen claimed the Iron Throne, usurping it from his nephew Prince Aegon Targaryen. When Maegor took the throne, Prince Aegon and his wife Princess Rhaena Targaryen were besieged at Crakehall (and later protected at Casterly Rock), but both Quicksilver and Rhaena's dragon Dreamfyre were in King's Landing. While King Maegor was in Oldtown for half a year in 43 AC, Aegon and Rhaena took note of his long absence from the capital. They managed to successfully infiltrate King's Landing with the help of several collaborators within the city, though they knew they dare not seize the throne as they lacked the strength to hold it. They had come for dragons — Rhaena was reunited with Dreamfyre, and Aegon finally claimed a dragon, his father's Quicksilver. They had entered the city in a mule-drawn wagon, but left it flying on dragonback. In 43 AC, Prince Aegon attempted to win back the throne that by rights was his, returning to the westerlands and riverlands to assemble an army. His allies gathered at House Piper's Pinkmaiden Castle. Aegon, mounted on Quicksilver, descended from the sky to denounce Maegor as a tyrant and usurper, and called upon all honest men to rally to his banners. Fifteen thousand men joined the rebellion, and marched through the riverlands towards King's Landing, led by Aegon the Uncrowned on Quicksilver. Royalist armies marched toward him from three directions, and Aegon's army was larger than any of the three, but the inexperienced young commander did not want to attack and defeat each one separately, and continued towards the capital. Just south of the Gods Eye, Prince Aegon found a force of crownlands men blocking his path. Aegon ordered a charge against the hill where the Kingslanders had gathered, hoping to shatter them before the other hosts could flank him. Aegon mounted Quicksilver, intending to lead the attack. But he had only taken off when King Maegor appeared from the south upon the back of his dragon Balerion, four times as large as Quicksilver. For the first time since the Doom of Valyria, dragon fought dragon in the sky, while the Battle Beneath the Gods Eye was fought below. Quicksilver was no match for the older, fiercer dragon, and her pale white fireballs were overcome by Balerion's masses of black flame. Then Balerion fell upon Quicksilver from above, grabbed her neck in his jaws, and ripped one of her wings from her body. Quicksilver fell to her death, along with Prince Aegon.",
        "image": "/images/Quicksilver.jpg"
    },
    {
        "name": "Rhaegal",
        "hatched": "In 299 AC, Dothraki sea.",
        "died": "Alive.",
        "rider": "Commanded by Daenerys Targaryen.",
        "colors": "Rhaegal is a green and bronze dragon. His dark scales and wings are jade-green, and his eyes are described initially as molten gold and later as bronze. The dragon has black claws and teeth like black needles. His dragonflame has been described as being yellow, red and yellow, and orange-and-yellow fire shot through with veins of green.",
        "discription": "Rhaegal is one of the dragons born on the Dothraki sea, along with Drogon and Viserion. Commanded by Daenerys Targaryen, he is named for her late brother, Prince Rhaegar Targaryen.",
        "history": "At the wedding of Daenerys Targaryen to Khal Drogo by Pentos, she receives multiple bride gifts, including three petrified dragon eggs from Magister Illyrio Mopatis. Rhaegal's egg is a deep green, with burnished bronze flecks that comes and goes depending on how Daenerys turns it. The maegi Mirri Maz Duur proclaims that in order to bring new life one has to give life. Daenerys burns Drogo's body, along with Mirri herself and the three eggs, birthing Rhaegal, along with his brothers, Viserion and Drogon. In the red waste, Daenerys names the green dragon Rhaegal, after her late brother Rhaegar. At Vaes Tolorro, Rhaegal tries to fly in Daenerys's tent and screams after landing on her carpet. When Daenerys arrives in Qarth, Rhaegal and the other dragons are a marvel in the ancient city. Rhaegal is with Daenerys when she receives the news of the death of King Robert I Baratheon from Quhuru Mo. Daenerys takes Rhaegal on her shoulder when she petitions the Pureborn in the Hall of a Thousand Thrones and then travels with Xaro Xhoan Daxos in his palanquin. Rhaegal grows to the size of a small dog, and he flies above as Daenerys sails toward Astapor. When Daenerys has the Unsullied attack the Good Masters in the sack of Astapor, Jhiqui frees Rhaegal to attack the slavers. Rhaegal hisses at Grazdan mo Eraz when Daenerys meets with the envoy outside Yunkai. The green dragon belches flame when an angry Daenerys confronts Ser Jorah Mormont and Ser Barristan Selmy, After conquering Meereen and claiming the Great Pyramid, Daenerys finds Rhaegal sunning himself on the pyramid's terrace. Rhaegal and the other dragons begin to misbehave, with Rhaegal snapping at Irri. His head grows larger than a horse's. When Drogon allegedly kills the young girl Hazzea outside Meereen, Daenerys has Viserion and Rhaegal chained in a makeshift dragon pit in the Great Pyramid. Rhaegal fights fiercely while being removed from the terrace, and six men are burned during the three days it takes to move the green dragon.[15] Rhaegar becomes more savage during his confinement. Daenerys introduces Prince Quentyn Martell to Rhaegel and Viserion in the pit. After Daenerys disappears on Drogon's back from Daznak's Pit, Quentyn attempts to steal a dragon after enlisting the help of the Windblown. Quentyn attempts to dominate Viserion with a whip, but, unbeknownst to the knight, Rhaegal is behind him. The green dragon looses his dragonflame  and fatally burns Quentyn. Once loosed from the pit, Rhaegal attempts to make his lair atop the pyramid of Hazkar, killing many slavers there, but the building collapses into ruin. Rhaegal then makes his new lair in the pyramid of Yherizan. Ser Barristan Selmy notes that thus far, Rhaegal has shown himself to be more dangerous than his brother Viserion. As the second siege of Meereen begins, Rhaegal and Viserion are both drawn to the battle. Tyrion Lannister sees Rhaegal circling above the bay, banking and turning as longships and galleys clash and burn below him. When Ben Plumm and his companions come galloping back from the camp of Malazza, the Girl General, Rhaegal is still prowling, soaring in wide circles above the city and the bay on great green wings.",
        "image": "/images/Rhaegal.jpg"
    },
    {
        "name": "Seasmoke",
        "hatched": "In or before 101 AC.",
        "died": "In 130 AC, Tumbleton.",
        "rider": "Laenor Velaryon, Addam of Hull.",
        "colors": "Pale silver-grey.",
        "discription": "Seasmoke was a dragon ridden at first by Ser Laenor Velaryon and later by the dragonseed, Addam of Hull, Seasmoke was a pale silver-grey dragon. It was of fighting size during the Dance but still a young dragon and nimbler in the air than his older brothers. He was of comparable size to Tessarion, who was about three times smaller than Vermithor, and not as fearsome a beast as him in comparison.",
        "history": "By 101 AC, Seasmoke was a young dragon bonded with Laenor Velaryon though he had yet to ride him. Seasmoke was Laenor's pride and passion. After Laenor's death in 120 AC, Seasmoke made its lair in the Dragonmont on the island of Dragonstone and remained riderless for almost a decade, During the Dance of the Dragons, Laenor's son, Prince Jacaerys Velaryon, desired new dragonriders for his faction. He offered knighthood, lands, and riches to whoever could claim the riderless dragons. Most of the attempts to claim a dragon ended in death or heavy burns in an event remember as the Red Sowing. In one of those attempt, Seasmoke killed Ser Steffon Darklyn, one of Rhaenyra Targaryen's Queensguard. Later, the fifteen-year-old Addam of Hull was able to claim and ride Seasmoke, however. Addam used Seasmoke to protect his younger brother, Alyn of Hull, from Sheepstealer during his attempt to claim him. Addam and Alyn were declared to be bastard sons of the late Laenor, though it was rumored that they where truly bastards of Laenor's father, Lord Corlys Velaryon of Driftmark. Either way Addam's blood relation to Seasmoke's previous rider may have been a factor in it accepting him. Corlys convinced Queen Rhaenyra to remove the taint of bastardy to Addam and Alyn, thus Addam of Hull became Ser Addam Velaryon, heir of Driftmark. Seasmoke was one of the five dragons participating in the Battle in the Gullet against the Triarchy,[5] and also took part in the Fall of King's Landing. Once it was decided that Queen Rhaenyra would remain in King’s Landing, Syrax, Seasmoke, and Tyraxes were expected to suffice for the defense of the city, and the rest of the dragonriders went to battle. Seasmoke was kept in the Dragonpit while in the capital. With the Two Betrayers on their minds, many voices in the black council questioned Ser Addam’s loyalty. Only the Queen's Hand, Lord Corlys Velaryon, spoke in defense of the dragonseed, remarking that Ser Addam and his brother Alyn were “true heirs” and worthy of Driftmark. The Hand’s impassioned protests were in vain and Queen Rhaenyra, suspecting a turncloak, commanded Ser Luthor Largent to arrest Addam in the Dragonpit. Ser Addam, who had been forewarned, managed to make his escape flying away with Seasmoke, fleeing before he could be put to the question. By ordering the arrest of Addam, the queen lost not only a dragon but her Queen’s Hand as well. Corlys was beaten and imprisoned for warning Addam. As the Second Battle of Tumbleton was put into motion, Ser Addam was determined to prove that all bastards need not be turncloaks. Ser Addam attacked Tumbleton at night, taking the greens completely unawares. As chaos ensued Addam could see the battle turning into a rout below him. By this time, two of the enemy dragonriders, Hugh Hammer and Daeron the Daring, were dead; although Addam could not have known that, he could see Vermithor, Silverwing and Tessarion. The riderless Tessarion took flight and Addam turned his dragon to meet her. Both being young dragons they moved fast and nimbly as they fought. The fight ended when the riderless, enraged Vermithor rose into the sky and set about indiscriminately killing those on the ground. As the Bronze Fury wreaked carnage, Seasmoke fell upon him, driving him shrieking into the mud. According to Archmaester Gyldayn, Addam must have felt duty bound to protect his men on the ground, though surely he knew in his heart Seasmoke could not match the older dragon. The riderless Blue Queen soon joined the fray and all three dragons fought to the death on the ground amidst mud and blood and smoke. Vermithor killed Seasmoke when he locked his teeth into his neck and ripped his head off. He attempted to take flight with his prize still in his jaws but his tattered wings could not lift his weight. After a moment he collapsed and died. Vermithor had also mortally wounded Tessarion, who died soon afterwards. After the Second Battle of Tumbleton, Lord Unwin Peake ordered a retreat, taking the remnants of the great host that Prince Daeron and Lord Ormund Hightower had led from Oldtown. The accused turncloak Addam Velaryon had saved King’s Landing from the queen’s foes at the cost of his own life. Seasmoke and Vermithor's remains became a tourist attraction at the rebuilt Tumbleton.",
        "image": "/images/Seasmoke.jpg"
    },
    {
        "name": "Sheepstealer",
        "hatched": "In or after 35 AC, Dragonstone.",
        "died": "In 136 – 153 AC (presumably).",
        "rider": "Nettles.",
        "colors": "Mud brown.",
        "discription": "Sheepstealer was a wild male dragon during the Dance of the Dragons with a taste for mutton. He lived at the back of Dragonmont and would hunt between Driftmark and Wendwater. The smallfolk of Dragonstone named him for a self-evident reason. At the start of the Dance of the Dragons, he was one of three wild dragons living on Dragonstone.",
        "history": "Sheepstealer's coloring was an ugly mud brown. He was not aggressive towards humans unless provoked, but could be vicious and ill-tempered. He had a taste for mutton. While he devoured the occasional sheep dog, he never harmed a shepherd. Grand Maester Munkun described Sheepstealer and his rider Nettles as a skinny brown girl on a skinny brown dragon, though it is also noted that Munkun never actually saw Nettles.[5] Thus the accuracy of Munkun's discription is unknown. Sheepstealer was not a young dragon by the time Nettles bonded with him, well over fifty years old. On the other hand, Dreamfyre was even older than Sheepstealer, but was consistently described as slender - thus it's possible that Sheepstealer could have both been large and of slender build, Sheepstealer's dragon egg hatched when the Old King Jaehaerys I Targaryen was still young.[2] It is unclear if that means in the early years of Jaehaerys's reign, thus in or after 48 AC, or generically during his youth, thus in or after 35 AC (34 AC is not counted, since it is implied Sheepstealer was younger than Vermithor).[5][6] Sheepstealer made his lair in the caverns of the Dragonmont on Dragonstone, and would hunt sheep as far as on Driftmark and at the Wendwater. Sheepstealer went unclaimed by any rider in his youth, which made him more and more unused to the presence of men and harder to claim with each passing year. Eventually he spent over seven decades living wild on Dragonstone, snatching sheep from pastures across Blackwater Bay. During the early phase of the Dance of the Dragons, Jacaerys Velaryon called upon any potential dragonseeds to try and claim a dragon to ride. During this event, which became known as the Sowing, Sheepstealer was one of four dragons who people attempted to mount, and the only one who had never had a rider before. In the process, Sheepstealer killed more candidates than the other three dragons (Vermithor, Seasmoke, and Silverwing) combined. Silver Denys, who claimed to be a descendent of King Maegor I Targaryen, had his arm torn off by Sheepstealer when he tried to master the dragon, and Alyn of Hull was burned by the dragon when he made his attempt. A bastard girl named Nettles eventually managed to tame the dragon, through a cunning method. She left out a freshly killed sheep for the dragon every morning, causing the dragon to grow accustomed to her presence, until he allowed her to mount him.[4] Along with Rhaenyra Targaryen's other dragonriders, Nettles and Sheepstealer took part in the Battle of the Gullet and the rapid capture of King's Landing,[4] after which Sheepstealer made his lair in the Dragonpit. Nettles and Sheepstealer joined Prince Daemon Targaryen and his dragon Caraxes in hunting Aemond Targaryen and Vhagar along the Trident. They remained at Maidenpool, from where they continued their search every morning. When Queen Rhaenyra named Nettles a traitor, Nettles left Maidenpool with Sheepstealer early in the morning, after feeding Sheepstealer the largest black ram present at the castle. The dragon and its rider were last seen flying over the Bay of Crabs. When King Aegon II Targaryen regained the Iron Throne after Rhaenyra's death, there were reports that Sheepstealer had been seen at Crackclaw Point and the Mountains of the Moon. In 134 AC, during the reign of King Aegon III Targaryen, Ser Robert Rowan led a royal army to the Vale of Arryn to support Ser Joffrey Arryn. Robert's men encountered Sheepstealer and a ragged Nettles in a cave, and in the ensuing fight sixteen men were slain and threescore more were wounded. Nettles and her dragon were last seen flying deeper into the Mountains of the Moon. An offshoot clan of the Painted Dogs in the Vale came to worship a fire-witch, to whom they would send their boys with gifts for her. In exchange, they would face the flames of her dragon to prove their manhood. This offshoot clan was considered to be one of the most savage of the mountain clans, and stories are still told about this fire-witch to this day. Some of the maesters of the Seven Kingdoms believe that this practice was the origin of the tradition held nowadays by the Burned Men, where young men must give some part of their body to the fire to prove they have the courage to be a man.",
        "image": "/images/Sheepstealer.jpg"
    },
    {
        "name": "Shrykos",
        "hatched": "In  Around 123 AC",
        "died": "In 130 AC, the Dragonpit in King's Landing.",
        "rider": "owened by Jaehaerys Targaryen.",
        "colors": "Not mentioned.",
        "discription": "Shrykos was a young she-dragon bound to Prince Jaehaerys Targaryen during the Dance of the Dragons.",
        "history": "Shrykos died in the Dragonpit when it was invaded by a half-crazed angry mob after a one-handed prophet called the Shepherd began to rant against all dragons everywhere. Shackled by her heavy chains, Shrykos was slain by a woodsman known as Hobb the Hewer who leapt onto her neck driving his axe into her skull as she roared and twisted, trying to throw him off. With his legs locked around the dragon's neck, Hobb delivered seven blows and each time his axe came down he roared out the name of each of the Seven. It was the Stranger's blow that slew the dragon, his axe crashed through scale and bones into Shrykos's brain. There is little doubt that Shrykos killed scores of people in the Dragonpit before being slain. Shrykos was never ridden.",
        "image": "/images/Shrykos.jpg"
    },
    {
        "name": "Silverwing.",
        "hatched": "In 36 – 42 AC.",
        "died": "In 136 – 153 AC.",
        "rider": "Alysanne Targaryen, Ulf White.",
        "colors": "Silverwing has been described as a silvery dragon.",
        "discription": "Silverwing was a silvery she-dragon of House Targaryen. She was ridden by Queen Alysanne Targaryen, and later by Ulf White during the Dance of the Dragons,  She was considered relatively docile and friendly to strangers. Silverwing often coiled with Vermithor.",
        "history": "According to legend, Silverwing hatched from a dragon's egg that had been placed in the cradle of Alysanne Targaryen by her sister Rhaena, in 36 AC. In 42 AC, at Dragonstone, Silverwing contributed her flames to the funeral pyre of King Aenys I Targaryen, together with the dragons Quicksilver and Vermithor. In 44 AC, Alysanne, her brother Jaehaerys, and their mother Alyssa Velaryon resided on Dragonstone as the hostages of Dowager Queen Visenya Targaryen. In the chaos following Visenya's death of natural causes that year, Alysanne, Jaehaerys, and Alyssa fled the island, along with Alysanne's dragon Silverwing and Jaehaerys's dragon Vermithor. Silverwing had accepted Alysanne as her rider by 48 AC. After King Maegor I Targaryen's death, Alysanne flew Silverwing to King's Landing, together with her brother Jaehaerys and her sister Rhaena upon their dragons, Vermithor and Dreamfyre, so Jaehaerys could claim the Iron Throne. In 49 AC, Jaehaerys and Alysanne flew Vermithor and Silverwing from the Red Keep to Dragonstone to secretly marry, without the permission of the Queen Regent Alyssa Velaryon or the Hand of the King Rogar Baratheon. Dragonstone remained their refuge for the remainder of the king's minority. During the course of Jaehaerys's long reign, he spent much time guesting with lords or holding audience in towns and villages. He would fly there upon Vermithor, with Queen Alysanne soaring on Silverwing beside him. In 54 AC, Alysanne flew Silverwing to Oldtown for the funeral of the High Septon. The dragon alighted atop the Hightower, fanning the flames of the tower's beacon with her wings, which made the city gasp. Later that year, Alysanne and Jaehaerys flew Silverwing and Vermithor to Storm's End so that they could be with their mother Alyssa when she died in labor. Still later, Alysanne flew Silverwing to Dragonstone, to comfort her sister Rhaena in her grief for the deaths of her companions. At the end of the year, when Rhaena flew to King's Landing in search of her missing daughter Aerea, Silverwing and Vermithor rose up and roared at Dreamfyre's arrival, and those watching were afraid the dragons would fight. In 56 AC, when the Targaryens began to house dragons in the Dragonpit, Silverwing and Vermithor did not join Balerion and three younger dragons, but instead remained at the Red Keep, where they would be close to their riders. In 58 AC, Alysanne flew Silverwing to White Harbor, Winterfell, and later the Wall, on a planned royal progress that Jaehaerys was initially unable to accompany due to duties in King's Landing. In White Harbor, tens of thousands of northerners turned out to cheer Alysanne and gape at Silverwing with awe and terror. At Winterfell, Lord Alaric Stark refused to allow Silverwing within his walls, citing the burning of Harrenhal. Later, Alysanne's charm convinced him to approach Silverwing, though warily. Alysanne grew restless waiting for Jaehaerys to arrive at Winterfell, and flew Silverwing to the Wall, stopping at Last Hearth and several smaller keeps (including Queenscrown) on the way. At Castle Black, the men of the Night's Watch were as awed by Silverwing as the people of White Harbor had been, but Alysanne noted that Silverwing does not like this Wall. The dragon would hiss and snap at every chilly gust of wind coming down from the Wall. Alysanne attempted on three occasions to fly Silverwing north beyond the Wall, but the dragon refused and veered south every time. Alysanne wrote to Jaehaerys that she was troubled by the fact that Silverwing refused to fly over the Wall, despite never refusing her commands previously. Alysanne later flew Silverwing back to Winterfell to reunite with Jaehaerys, and from there they flew to Torrhen's Square, Barrowton, and back to King's Landing. In 82 AC, Alysanne flew Silverwing to the Eyrie, to be with her daughter Daella Targaryen during her first pregnancy and childbirth. In 92 AC, Alysanne quarreled with Jaehaerys over his decision to pass over his granddaughter Rhaenys, the only heir of his deceased eldest son Aemon, in favor of his son Baelon, in the line of succession. Alysanne departed King's Landing and flew to Dragonstone on Silverwing, where she remained apart from Jaehaerys for two years, in an estrangement that became known as the Second Quarrel. The couple reconciled in 94 AC, with the help of their daughter, Septa Maegelle, though they never reached accord on the succession. In 93 AC, Silverwing was ridden by Alysanne for the last time. Alysanne wept as she climbed painfully from her dragon's back. Silverwing became riderless upon Alysanne's death in 100 AC, Silverwing returned to Dragonstone after Alysanne's death, where she made her lair in one of the smoking caverns of the Dragonmont.[15] She remained there, riderless, until 129 AC, during the Dance of the Dragons.[16] When Prince Jacaerys Velaryon decided that his mother Queen Rhaenyra Targaryen's faction, the blacks, needed more dragonriders, he sent out a call for men to claim one of the riderless dragons upon Dragonstone, in an event known as the Sowing of the Seeds. The court fool Mushroom relates a story in his Testimony about his attempt to mount Silverwing, considered to be the most docile of the masterless dragons. It is an amusing if unlikely tale, which ends with Mushroom running across the ward of Dragonstone with the seat of his pants on fire, and nearly drowning when he leaps into a well to quench the flames. Of the four riderless dragons who were claimed during the Sowing, Silverwing is the only one who is not described as killing any man who attempted to ride her. Ultimately, Silverwing accepted a dragonseed man-at-arms called Ulf the White as her new rider. Ulf rode Silverwing to battle in the Battle in the Gullet. Along with Vermithor, Sheepstealer, Vermax, and Seasmoke, Silverwing descended upon the ninety warships sailing under the banners of the Three Daughters.The first battle at Tumbleton, as depicted by Douglas Wheatley in Fire & Blood, When King's Landing fell to Rhaenyra Targaryen's supporters, Ulf landed Silverwing upon the Hill of Rhaenys, outside of the Dragonpit. In the Dragonpit, Silverwing made a lair before flying off to battle. Ulf rode Silverwing into battle during the first battle at Tumbleton. Ulf and fellow dragonseed Hugh Hammer, who had claimed Vermithor, changed their allegiance, betraying Rhaenyra in favor of Aegon II Targaryen. Silverwing, Vermithor, and Tessarion, the dragon of Aegon II's brother Prince Daeron, let loose their flames upon Tumbleton, which was savagely sacked.Ulf and Silverwing remained with the Hightower host at Tumbleton. Silverwing was kept unchained beyond the town walls, free to fly and hunt. During the Second Battle of Tumbleton, an army of four thousand men strong, led by Ser Addam Velaryon upon the dragon Seasmoke, surprised the Hightower host at Tumbleton with their night-time attack. Ulf slept through the battle, but even without a rider Silverwing took to the sky during the battle. At one point, a crossbowman shot a bolt at the dragon. Silverwing avoided further battle and instead circled the battlefield for hours. She descended only again the next day, after the sun had gone down, and landed between the slain Vermithor, Seasmoke, and Tessarion. The singers claim that Silverwing attempted to lift Vermithor's wing on three occasions, but Archmaester Gyldayn considers this most likely to have been a fable. When the sun rose again, Silverwing began to fly listlessly across the field, where she fed on the burned carcasses of men and animals. Silverwing's rider, Ulf White, insisted he should become the new king of the Seven Kingdoms, as King Aegon II was missing, and Prince Aemond and Daeron had died. When Ser Hobert Hightower, one of the Caltrops, gave Ulf poisoned wine, Silverwing became riderless once again. At Tumbleton, Lord Unwin Peake offered a thousand golden dragons to any knight of noble birth able to claim Silverwing. Out of the three men who came forth, the first had his arm torn off and the second burned to death. The third man then changed his mind. Silverwing was one of only four dragons still alive at the end of the Dance of the Dragons. Although accustomed to men, Silverwing became wild during the reign of Aegon III Targaryen, and made her lair on a small island in Red Lake in the northwest of the Reach. When seeking a new dragon to replace the late Sunfyre, Aegon rejected Lord Borros Baratheon's suggestion of Silverwing, as he was too weak to travel across the war-torn country to Red Lake or mount a grown dragon. Silverwing continued living at Red Lake during the regency of King Aegon III Targaryen.",
        "image": "/images/Silverwing.jpg"
    },
    {
        "name": "Stormcloud",
        "hatched": "Around 120 - 129AC.",
        "died": "In 130 AC, Dragonstone.",
        "rider": "Aegon The Younger.",
        "colors": "Not Mentioned.",
        "discription": "Stormcloud was a young male dragon bonded with Prince Aegon the Younger.",
        "history": "A dragon egg was placed in the cradle of Prince Aegon Targaryen at his birth, and hatched into the dragon Stormcloud. At the start of the civil war called the Dance of the Dragons, nine-year-old Aegon had yet to mount his young dragon. During the civil war, it was decided by Prince Jacaerys Velaryon that his half-brothers Aegon and Viserys Targaryen should be sent to Pentos to be fostered by the Prince of Pentos for their own safety. In late 129 AC, the young princes boarded the Pentoshi cog Gay Abandon at Dragonstone. Aegon took Stormcloud with him, and Viserys took his dragon egg. In the Gullet, the cog and her escort ships were captured by warships sailing under the banners of the Three Daughters. Aegon escaped by flying away on Stormcloud, his first flight. Prince Aegon managed to reach Dragonstone, clinging desperately to his dragon's neck. Stormcloud had been terribly wounded as he fled; when he arrived at Dragonstone stubs of countless arrows were embedded in his belly, and there was a scorpion bolt through his neck. Stormcloud died within the hour, hissing as the hot blood gushed black and smoking from his wounds. After Stormcloud's death, Aegon would never fly again.",
        "image": "/images/Stormcloud.jpg"
    },
    {
        "name": "Sunfyre",
        "hatched": "Before 120 AC, Dragonmont.",
        "died": "In 130 AC, Dragonstone.",
        "rider": "Aegon II Targaryen.",
        "colors": "Sunfyre had gleaming gold scales, which shone like beaten gold in the sunlight, and pale pink wing membranes. His flames were golden as well.",
        "discription": "Sunfyre, also known as Sunfyre the Golden, was a male dragon ridden by King Aegon II Targaryen. The three-headed Targaryen dragon in the arms of Aegon was made golden to honor Sunfyre.",
        "history": "Huge and heavy, the splendid Sunfyre was a formidable fighter despite his youth. Sunfyre's egg hatched on Dragonstone. Although his exact year of birth has not been stated, he was described as being a young dragon in 120 AC and 129 AC. Sunfyre is known to have been older than Tessarion. Although it is unknown when exactly Prince Aegon Targaryen claimed Sunfyre as his mount, he is known to have been claimed by the prince by 120 AC. King Aegon II Targaryen rode Sunfyre during the Dance of the Dragons, the civil war fought between the greens of Aegon and the blacks of his half-sister, Queen Rhaenyra Targaryen. Ser Criston Cole, Aegon's Hand of the King, lured Princess Rhaenys Targaryen and her dragon, Meleys, into a trap in the battle at Rook's Rest, one of the first major battles of the war, in 129 AC. While Meleys was burning Criston's army of greens besieging the castle, Aegon and his younger brother, Prince Aemond Targaryen, appeared on their own dragons, Sunfyre and Vhagar, and the three beasts fought a thousand feet above the field. When Meleys closed her jaws around Sunfyre's neck, Vhagar fell upon them from above, causing the three dragons to fall to the earth. Although Vhagar rose unscathed, Meleys was slain and Sunfyre had one wing half torn from his body. King Aegon, grievously injured and burned from the encounter, was taken to King's Landing to recuperate. Unable to fly and too huge and heavy to be moved, Sunfyre remained near Rook's Rest to allow him time to heal. Criston stationed men near the dragon to guard him. At first, the dragon fed on the burned carcasses of the slain soldiers, but after those were gone, Criston's men brought Sunfyre calves and sheep to eat. When Walys Mooton, Lord of Maidenpool, reconquered Rook's Rest from Aegon II's forces, he led his bravest men to Sunfyre, hoping to slay the dragon. Enraged by the attacks upon him, Sunfyre fought back with his tail and flames, killing threescore of his attackers, including Walys. Within a fortnight of the attack, Sunfyre had disappeared. Although his wing had healed in an awkward angle, Sunfyre had recovered enough from his battle with Meleys to fly once again. Ser Byron Swann was killed in an attempt to slay a dragon during the war, although sources vary as to which dragon he faced. Septon Eustace wrote that Byron desired to kill Sunfyre, but Archmaester Gyldayn expresses doubt because the golden dragon had gone missing from Rook's Rest. Lord Larys Strong helped King Aegon II Targaryen escape the capital during the fall of King's Landing to the blacks of Queen Rhaenyra Targaryen, and the king then hid in a remote fishing village on the isle of Dragonstone. According to the Crabbs and Brunes, Sunfyre hid in the dark piney woods and caves of Crackclaw Point before eventually making his way to Dragonstone. Gyldayn conjectured of a primal instinct for Sunfyre return to his birthplace, or urge to rejoin his rider, Aegon. Some even suggested that Sunfyre was able to feel Aegon II's urgent need of him. Because of Sunfyre's difficulty flying, Mushroom claimed the dragon was a great golden fire-breathing chicken. Sailors on Nessaria observed two dragons—one of them with golden scales—fighting near the Dragonmont, and the partially-devoured corpse of a wild dragon, the Grey Ghost, was then found near the mountain's base. Ser Robert Quince, castellan of Dragonstone, assumed that the Grey Ghost had been killed by the Cannibal. Intrigued by the mention of the golden scales, however, the disguised Aegon ventured forth with Ser Marston Waters, Tom Tanglebeard, and Tom Tangletongue, and the party found Sunfyre in a hidden lair on the Dragonmont. Aegon flew upon Sunfyre every day, regaining strength, while the Two Toms and Marston sought supporters to help Aegon take Dragonstone from Rhaenyra. Ser Alfred Broome aided in the fall of Dragonstone to Aegon's greens. Lady Baela Targaryen evaded capture, however, and reached her green dragon, Moondancer. When Aegon victoriously flew a still-injured Sunfyre to the castle, Moondancer rose to meet him. Although younger and smaller, Moondancer was quicker than Sunfyre. Moondancer raked Sunfyre's side and attacked his malformed wing, but she was then blinded by a blast of Sunfyre's golden flames. The colliding dragons crashed into the ground, where the larger Sunfyre killed his younger adversary. Aegon broke both of his legs jumping clear, and Baela was taken captive by the greens. The battle with Moondancer left Sunfyre even more injured than he had been before. He was covered in fresh scars along his back, had huge wounds along his neck and scabs on his belly, and had lost his right eye. No longer able to fly, Sunfyre remained in the outer yard where he had fallen, feeding first on the carcass of Moondancer and later on slaughtered sheep. Aegon had Grand Maester Gerardys strangled and disemboweled, allowing Sunfyre to feast upon the legs and innards. Aegon had the maester's head and upper torso put on display at Dragonstone's gatehouse to welcome Rhaenyra for her eventual return, as the queen had fled King's Landing after the Storming of the Dragonpit. When the Violande brought Rhaenyra Targaryen to Dragonstone on the twenty-second day of the tenth moon of 130 AC, she was taken captive by Ser Alfred Broome and the greens. Accounts differ on how the reunion between the half-siblings occurred, the pro-greens Septon Eustace says Rhaenyra laughed when she saw the crippled Sunfyre. Whereas she reflected on the war according to the pro-blacks Mushroom. In the end, Aegon fed his half sister to his dragon, and it is said that Sunfyre only reacted to Rhaenyra after her breast was pricked by Alfred's dagger, with the smell of her blood rousing the dragon. Sunfyre bathed her in a blast of flame before closing his jaws around her arm and shoulder. Sunfyre devoured Rhaenyra in six bites, leaving only her left leg below the shin. Prince Aegon the Younger was forced to watch his mother die, and Elinda Massey allegedly gouged out her eyes in horror. Although King Aegon II initially hoped that Sunfyre might recover enough to fly once again, the dragon weakened and eventually refused to eat. He died from his stinking wounds on the ninth day of the twelfth moon of 130 AC. A weeping Aegon ordered that the captive Baela Targaryen be executed, but he was convinced to spare her life to avoid angering House Velaryon. Aegon II returned to King's Landing to rule precariously. He sent for dragon eggs from Dragonstone, hoping for a new Sunfyre, prouder and fiercer than the last, but was unable to hatch one. Aegon the Elder was soon assassinated by poison and succeeded by Aegon the Younger, who ruled as Aegon III Targaryen.",
        "image": "/images/Sunfyre.jpg"
    },
    {
        "name": "Syrax",
        "hatched": "Before 104 AC.",
        "died": "In 130 AC, the Dragonpit, King's Landing.",
        "rider": "Rhaenyra Targaryen.",
        "colors": "Yellow.",
        "discription": "Syrax was a she-dragon. She was ridden solely by Rhaenyra Targaryen. Her name came from a goddess of Valyria. Syrax had yellow scales. She was huge and formidable, but not as fearsome or experienced in battle as Caraxes. She was kept in chains and exceedingly well fed. At the time of the civil war called the Dance of the Dragons, Syrax had not hunted for years.",
        "history": "Rhaenyra first took Syrax as a mount in 104 AC, when the princess was seven years old. Syrax was described as a young dragon at the time, and Rhaenyra herself named her Syrax (after a Valyrian goddess) - strongly implying that Syrax had no previous rider. Syrax laid several clutches of eggs during the reign of Viserys I Targaryen. Her latest clutch was produced just prior to the civil war. One of the eggs from that latest clutch was given to Rhaena Targaryen, Rhaenyra's step-daughter. It is somewhat implied that the dragons of Rhaenyra's sons all hatched from eggs laid by Syrax, though the only definitive information about any dragon parentage is that Rhaena's dragon Morning eventually hatched from one of Syrax's eggs. Following Rhaenyra's difficult stillbirth at the beginning of the war, she was unable to fly on dragonback for a time. However, Rhaenyra recovered enough strength to fly on Syrax, along with her other dragonriders, when they assaulted and captured King's Landing, facing little opposition. In King's Landing, Syrax was kept within the walls of the Red Keep, in a stable in the outer ward that had been emptied of horses and given over for her use. Heavy chains bound her to the ground. The chains were long enough to allow her to move from the stable to yard, but kept her from flying off riderless. The three other dragons belonging to the blacks were kept in the Dragonpit, along with the greens's Dreamfyre. About the same time of the Butcher's Ball, Ser Byron Swann set out to slay a dragon. According to the court fool Mushroom, Byron was killed in an attempt to slay Syrax, a claim confirmed by Ser Byron's squire. However, other sources suggested instead that Byron tried to kill Aemond Targaryen's dragon Vhagar or Aegon II's dragon Sunfyre. Syrax was slain in the aftermath of the Storming of the Dragonpit. Prince Joffrey Velaryon had attempted to mount her to ride to the Dragonpit and save the other dragons from the mob, and perhaps mount his own dragon Tyraxes there. Dragons are not horses, however, and they will only accept one rider during that rider's lifetime. In mid-flight, Syrax shrugged off Joffrey, who fell to his death. Attracted by the bloodshed at the Dragonpit, Syrax flew there. Archmaester Gyldayn noted that Syrax could have simply stayed high in the air and made runs at the mob with her flames, but instead she descended upon the ground, killing dozens with tooth and claw. There are numerous and contradicting accounts about specifically how Syrax died, and Gyldayn does not give them in detail. What is certain, is that Syrax eventually died fighting the rioters.",
        "image": "/images/Syrax.jpg"
    },
    {
        "name": "Terrax",
        "hatched": "When Valyrian Freehold was standing strong.",
        "died": "Not mentioned.",
        "rider": "Jaenara Belaerys.",
        "colors": "Not mentioned.",
        "discription": "Terrax was a dragon ridden by Jaenara Belaerys, a noblewoman and dragonrider from Valyria.",
        "history": "Jaenara flew Terrax further south into Sothoryos than anyone had ever gone before. The journey took her three years to complete, during which she found only jungle, mountains, and deserts, declaring Sothoryos to be “a land without end” and as large as Essos. Terrax is mentioned as one of the oldest dragons known in the ASOIAF universe, as Jaenara’s expedition occurred while the Valyrian Freehold was still standing strong.The Belaerys family went extinct in the Doom of Valyria or its aftermath.",
        "image": "/images/Terrax.jpg"
    },
    {
        "name": "Tessarion",
        "hatched": "In or before 120 AC.",
        "died": "In 130 AC, Tumbleton.",
        "rider": "Prince Daeron Targaryen.",
        "colors": "Blue, Dark cobalt wings, copper Scales and Cobalt blue flames.",
        "discription": "Tessarion, also known as the Blue Queen, was a she-dragon ridden by Prince Daeron Targaryen. Tessarion was a beautiful blue she-dragon. Her wings were a dark cobalt, while her claws, crest, and belly scales were the color of bright beaten copper. Her flames were cobalt blue in color as well.By 129 AC, Tessarion was of fighting size. During the Dance of the Dragons, she was the youngest dragon of fighting weight belonging to Aegon II Targaryen's supporters, meaning she was younger than Vhagar, Dreamfyre, and Sunfyre. By 130 AC, Tessarion was one-third in size to Vermithor. A young dragon at the time, Tessarion was nimble in the air.",
        "history": "By 120 AC, Tessarion had bonded with Prince Daeron Targaryen, although Daeron had not yet ridden her at the time. Although unknown when Daeron first flew Tessarion, Daeron had become a dragonrider by 129 AC. During the Dance of the Dragons, Daeron rode Tessarion into the Battle on the Honeywine in the Reach to save Lord Ormund Hightower and his army. Due to their arrival and participation in the battle, the Hightower army was victorious. Daeron and Tessarion remained with the Hightower army as it marched up the Roseroad towards King's Landing, which had fallen to Rhaenyra Targaryen's forces. During this time Daeron flew upon Tessarion ahead of the main column of the army to scout ahead, which proved invaluable to the southron host. Rhaenyra's loyalists often fled at the first glimps of Tessarion, being unwilling to face the dragon's fire in battle. At Tumbleton, a market town on the Mander, the Hightower army met in battle in the First Battle of Tumbleton with a smaller force of supporters of Rhaenyra. Tessarion participated in the battle. Tessarion and her rider remained at Tumbleton with the Hightower army afterwards. There, Tessarion was unchained, free to fly and hunt as she wished. The she-dragon slept in her rider's camp to the west of the town, not a hundred yards from his pavilion.Hugh Hammer, a dragonseed who had claimed Vermithor and who had changed his alliance from the blacks to the greens during the First Tumbleton, decided to make a claim for the Iron Throne after the disappearance of King Aegon II Targaryen and the death of Prince Aemond Targaryen, the Protector of the Realm. He felt secure in his decision as Tessarion, the only dragon of fighting weight with a rider still remaining to the greens, was one-third the size of his own dragon, and far less fearsome. Among the Caltrops, the lords and knights who conspired to kill Hammer and his fellow dragonseed, Ulf the White, Ser Tyler Norcross believed that Tessarion on her own should be enough to retake the Iron Throne, while Lord Unwin Peake argued that their victory would be more certain if they had the dragons of Hugh and Ulf in their possession as well. Matters came to a head two days later, when a surprise night attack by Addam Velaryon upon Seasmoke started the Second Battle of Tumbleton. Tessarion's rider was killed at the start of the battle. riderless, Tessarion flew up, shrieking and spitting flame, and met Addam Velaryon and Seasmoke in battle. The dragons rushed one another time and time again and at one point, Tessarion vanished into the clouds, reappearing behind Seasmoke breathing flames. It was said afterward that the fight between Tessarion and Seasmoke seemed to be more a mating dance than a battle. When Vermithor took to the sky, Addam Velaryon turned Seasmoke towards the older dragon. In their struggle, Tessarion suddenly attacked. The battle between the three dragons had a mortal outcome for all. Seasmoke and Vermithor died early, but Tessarion was the last to die. On three occasions did she try to fly again, but failed every time again. By late afternoon the day after the battle, she seemed to be in pain. At the command of Lord Benjicot Blackwood, Billy Burley, Blackwood's best archer, shot three arrows into the dying dragon's eye, killing her.",
        "image": "/images/Tessarion.jpg"
    },
    {
        "name": "Tyraxes",
        "hatched": "In 117 – 120 AC.",
        "died": "In 130 AC, the Dragonpit.",
        "rider": "Joffrey Velaryon.",
        "colors": "Likely to be Black and Red.",
        "discription": "Tyraxes was thriving and growing larger every year, he was slightly smaller than Vermax and Arrax. By the time of the Dance of the Dragons, he had recently being able to fly long distances with its rider, but was not quite big enough for combat yet.",
        "history": "Princess Rhaenyra Targaryen's three eldest sons by her husband, Ser Laenor Velaryon, were Jacaerys (b. 114 AC), Lucerys (b. 115 AC), and Joffrey (b. 117 AC). The rival faction at court who supported her stepmother Alicent Hightower and her children spread the accusation that Rhaenyra's three sons were not really Laenor's, but bastards fathered by Ser Harwin Strong. In an effort to confirm that he considered Rhaenyra and her sons the true heirs to the throne, her father King Viserys I decreed that a dragon egg would be put in the cradle of each of the boys, to bond with the dragons that hatched from them. Those who doubted the paternity of Rhaenyra's sons also doubted that the eggs would ever hatch, but they were quickly disappointed, as each of the eggs soon hatched in turn. The hatchlings were named Vermax (bonded with Jacaerys), Arrax (bonded with Lucerys), and Tyraxes (bonded with Joffrey). The exact date each hatched is not known but the last seems to have hatched by no later than about 120 AC. Joffrey repeatedly begged his mother to ride to war on Tyraxes but she forbade it.  Later on during the war, Jacaerys sent Joffrey and their cousin Rhaena of Pentos to the Vale of Arryn where they would be wards of Jeyne Arryn, the Lady of the Eyrie. Joffrey flew on Tyraxes with Rhaena from Dragonstone to Gulltown, then to the Eyrie. After Rhaenyra took King's Landing from the greens, she recalled Joffrey who flew back to the capital with Tyraxes.[3] During their time in the city, Tyraxes made his lair in the Dragonpit where he retreated during the riots, as would-be dragon slayer rushed after him. Tyraxes killed so many people with its fire that soon the corpses blocked the front entrance to his lair. Then the mob entered from the back entrance which got Tyraxes confused. Several men and one woman claimed to have killed Tyraxes but in the end he strangled himself with his own chains. After death, the membranes of his wings were cut off to make dragonskin cloaks by the Shepherd's followers.",
        "image": "/images/Tyraxes.jpg"
    },
    {
        "name": "Vermax",
        "hatched": "In 114 - 120 AC.",
        "died": "In 5th day of the 1st moon of 130 AC, The Gullet.",
        "rider": "Jacaerys Velaryon.",
        "colors": "Not described in the books (Olive green scales and pale orange wing membranes).",
        "discription": "Vermax was a dragon ridden by Prince Jacaerys Velaryon. Vermax was thriving and growing larger every year. Vermax became ill-tempered when in proximity of snow, ice, and cold.",
        "history": "When Prince Jacaerys Velaryon was young, there were rumors that he was a bastard, fathered by Ser Harwin Strong, instead of his mother Rhaenyra Targaryen's husband, Ser Laenor Velaryon. The rumors were spread by Queen Alicent Hightower and her followers at court. Those who doubted the paternity of Jacaerys and his brothers also doubted that the dragon eggs the boys had been given would ever hatch, but they were quickly disappointed, as each of the eggs soon hatched in turn. The hatchling that bonded with Prince Jacaerys was Vermax. By the time the Dance of the Dragons began, Vermax was big enough to ride. Prince Jacaerys flew north on his back, as a messenger for his mother, Queen Rhaenyra Targaryen, to treat with Jeyne Arryn, the Lady of the Eyrie, Desmond Manderly, the Lord of White Harbor, and Cregan Stark, the Lord of Winterfell. The mission was a success, as all three declared for Rhaenyra and her blacks. Snow, ice, and cold made Vermax irritable, so Jacaerys did not stay in the north for long, despite receiving a warm welcome at Winterfell. In his testimony, Mushroom claims that Vermax laid a clutch of eggs in the depths of the crypts of Winterfell, but this tale is most likely false. Archmaester Gyldayn states it is difficult to tell the sex of a dragon, but that no other source mentions that Vermax ever produced an egg, and dismisses Septon Barth's theory that dragons can change sex as ludicrous. Prince Jacaerys used Vermax in battle, during the Battle in the Gullet. There, Vermax attacked the Triarchy's fleet, and victory seemed at hand. But Vermax flew too low, possibly wounded from a crossbow bolt to the eye or pulled down by a grapnel, and crashed into a burning galley. Jacaerys leapt free and clung to the smoking wreckage of the ship, but was struck by Myrish crossbow quarrels until he sank into the sea, dead.",
        "image": "/images/Vermax.jpg"
    },
    {
        "name": "Vermithor",
        "hatched": "In 34 AC.",
        "died": "In 130 AC, Tumbleton.",
        "rider": "Jaehaerys I Targaryen, Hugh Hammer.",
        "colors": "Vermithor was a bronze dragon with 'great tan wings'.",
        "discription": "Vermithor, called the Bronze Fury, was a male dragon once ridden by King Jaehaerys I Targaryen.",
        "history": "Vermithor was already a large dragon in 48 AC; only Balerion and Vhagar were larger. By the time of the Dance of the Dragons, Vermithor was almost a hundred years old. Vermithor was a fearsome beast. Accustomed to men and having had a previous rider, by the reign of Aegon II Targaryen Vermithor was tolerant of the presence of people and more accepting of new riders. Vermithor often coiled with Silverwing. According to legend, Vermithor hatched from a dragon's egg that had been placed in the cradle of Prince Jaehaerys Targaryen by his sister Rhaena, in 34 AC. In 42 AC, at Dragonstone, Vermithor contributed his flames to the funeral pyre of King Aenys I Targaryen, together with the dragons Quicksilver and Silverwing. In 44 AC, Jaehaerys, his sister Alysanne, and their mother Alyssa Velaryon resided on Dragonstone as the hostages of Dowager Queen Visenya Targaryen. In the chaos following Visenya's death of natural causes that year, Jaehaerys, Alysanne, and Alyssa fled the island, along with Jaehaerys's dragon Vermithor and Alysanne's dragon Silverwing. Vermithor had accepted Prince Jaehaerys as his rider by 48 AC, when Jaehaerys made his claim for the Iron Throne. Nine days after the mysterious death of King Maegor I Targaryen, Jaehaerys flew to King's Landing upon Vermithor to claim the throne. During his reign, Jaehaerys I and his sister-wife, Queen Alysanne Targaryen, once visited Winterfell with six dragons. After Alysanne grew bored and flew her own dragon Silverwing north to the Wall, Jaehaerys came after her on Vermithor. Vermithor became riderless when Jaehaerys died in 103 AC. Throughout the reign of Jaehaerys's successor, King Viserys I Targaryen, Vermithor had no new rider. During this time, Vermithor remained on the island of Dragonstone and made his lair in one of the smoking caverns of the Dragonmont. In 129 AC, after the start of the Dance of the Dragons, Prince Jacaerys Velaryon decided that his mother's faction needed more dragonriders. Many men attempted to claim a dragon of their own; Lord Gormon Massey attempted to approach Vermithor, who burned him to death. Eventually, Vermithor bent his neck to a blacksmith’s bastard called Hugh Hammer. Hugh rode Vermithor to battle in the Battle in the Gullet. Along with Silverwing, Sheepstealer, Vermax and Seasmoke, Vermithor descended upon the ninety warships sailing under the banners of the Three Daughters. When King's Landing fell to Rhaenyra Targaryen's supporters, Hugh landed Vermithor upon the Hill of Rhaenys, outside of the Dragonpit. In the Dragonpit, Vermithor made a lair before flying off to battle. Hugh rode Vermithor into battle during the first battle at Tumbleton. Hugh and fellow dragonseed Ulf the White, who had claimed Silverwing, changed their allegiance, betraying Rhaenyra in favor of Aegon II Targaryen. Vermithor, Silverwing and Tessarion, the dragon of Aegon II's brother Prince Daeron, let loose their flames upon Tumbleton, which was savagely sacked. As the Hightower host remained at Tumbleton, so did Hugh with Vermithor. With Aegon II missing and Prince Aemond Targaryen dead, Hugh Hammer decided to fulfill his wish for the crown and declared himself king, as he was the rider of the oldest and largest living dragon. During the Second Battle of Tumbleton, an army of four thousand men strong, led by Addam Velaryon upon the dragon Seasmoke, surprised the Hightower host at Tumbleton with their night-time attack. Hugh rushed to mount Vermithor but was stopped by Jon Roxton, one of the Caltrops, who killed Hugh with his Valyrian steel sword Orphan-Maker. Vermithor, now riderless, was still half-asleep and on the ground when two score knights attempted to slay him. They died in their attempt. Wounded and enraged, Vermithor took flight, attacking all those around him. He snatched up a knight who tried to flee before him in his jaws, and burned Lords Piper and Deddings, with their squires, servants, and sworn shields. While Vermithor was only twenty feet above the field, Seasmoke slammed into him from above. The two dragons rolled over the field, so entangled that neither was able to break free. According to Lord Benjicot Blackwood, Seasmoke was no match for Vermithor on account of the older dragon's size and weight. Lord Blackwood believed that Vermithor would have torn Seasmoke into pieces if Tessarion had not entered the fight. The three dragons fought to the death. Vermithor killed Seasmoke when he locked his teeth into the latter's neck and ripped his head off. He attempted to take flight with his prize still in his jaws but his wings were tattered, causing him to be unable to bear the weight. After a moment he collapsed and died. It is said that after dark Silverwing, who had fled into the sky when the battle began, descended to land beside the slain dragons. Later, the singers would tell of how she tried to lift Vermithor’s wing three times with her nose, as if to try and make him fly again. According to Archmaester Gyldayn this is most likely a fable. Vermithor and Seasmoke's remains became a tourist attraction at the rebuilt Tumbleton.",
        "image": "/images/Vermithor.jpg"
    },
    {
        "name": "Vhagar",
        "hatched": "In 52 BC, Dragonstone.",
        "died": "In 22nd day of the 5th moon of 130 AC (aged 181), the Gods Eye.",
        "rider": "Visenya Targaryen, Baelon Targaryen, Laena Velaryon, Aemond Targaryen.",
        "colors": "Bronze with greenish blue highlights and bright green eyes.",
        "discription": "According to Tyrion Lannister, Vhagar was large enough that one could ride a horse down her gullet. It is said that Vhagar's breath was so hot that it could melt a knight's armor and cook him inside. By the time of the Dance of the Dragons, Vhagar was the hardened survivor of a hundred battles, had grown almost as large as Balerion, and was the oldest and largest of the dragons in Westeros. Her roar was so powerful that it could shake the very foundations of Storm's End. No living dragon could match her for size or ferocity.",
        "history": "Vhagar hatched from a dragon egg on Dragonstone during the Century of Blood. She was named after a god of the Valyrian Freehold. At some point, Vhagar was claimed by Visenya Targaryen. Visenya first rode Vhagar, demonstrating she was a dragonrider, some time before she married her brother, Aegon. After Aegon landed on Westeros and began his conquest, Visenya flew Vhagar to Stokeworth, where crossbowmen loosed bolts until the dragon set the roofs of the castle keep ablaze. Following Aegon's first coronation, Visenya, upon Vhagar, accompanied the Targaryen fleet, commanded by Daemon Velaryon, to take Gulltown. In the battle in the waters off Gulltown, the Arryn fleet defeated the Targaryen fleet, sinking one-third of the ships and capturing near as many. Then, Visenya descended, and burned the ships of the Arryn fleet. Visenya then flew to Crackclaw Point with Vhagar, to accept many pledges of fealty from the local lords. She then flew Vhagar to Stoney Sept to link up with her siblings, their dragons, and Aegon's army. They advanced south, where all three dragons took part in the decisive Field of Fire – the only battle in which all three of the Targaryen dragons took to the sky at the same time during Aegon's Conquest. Together, Vhagar, Meraxes, and Balerion killed four thousand men, burning them alive. King Mern IX Gardener died, and with him House Gardener. The army was broken, and House Targaryen was victorious. Visenya next flew Vhagar to the Trident in the riverlands, where she met with her brother and sister and their dragons, to face King in the North Torrhen Stark. Brandon Snow, the bastard brother of Torrhen, offered to sneak into the Targaryen camp at night to slay the dragons, but the northern king refused the attempt, and instead sent his brother as an envoy, eventually bending the knee to the Targaryens. Afterwards, Visenya flew Vhagar back to the Vale, where she landed with her dragon in the inner courtyard of the Eyrie. When Dowager Queen Sharra Arryn reached the courtyard she found her young son, King Ronnel Arryn, sitting on Visenya's knee, staring with wonder at Vhagar. The young king begged his mother for a ride on Vhagar's back. Sharra bent her knee and surrendered, and Ronnel rode on Vhagar thrice about the summit of the Giant's Lance. Following the deaths of Rhaenys and Meraxes in 10 AC at Hellholt in Dorne, Visenya and Aegon burned every Dornish stronghold at least once (except Sunspear and its shadow city) during a two-year period known as the Dragon's Wroth. The Dornish tell a tale that the Targaryens refused to attack Sunspear because they were afraid that Princess Meria Martell had purchased a device from Lys to slay Vhagar and Balerion, but Archmaester Timotty suggests the Targaryens intended to turn the other Dornish houses against the Martells. When King Aegon I died in 37 AC, Vhagar supplied the flames to light the fire of his funeral pyre. In 41 AC, when King Aenys I Targaryen named his eldest son and heir, Prince Aegon, the Prince of Dragonstone at his wedding, Visenya angrily left for Dragonstone. It was said that the moon turned as red as blood when Vhagar passed it. Later that year, when King Aenys arrived at Dragonstone, fleeing the first rebels in the Faith Militant uprising, Visenya asked him to grant her leave to take Vhagar and burn the Starry Sept in Oldtown. Aenys refused. When the king died early in 42 AC, Visenya left Dragonstone within an hour of his death, and flew to Pentos, where her son Maegor lived in exile. After Maegor had claimed the crown on Dragonstone, Visenya accompanied him upon Vhagar and crossed Blackwater Bay to King's Landing. The return of both Vhagar and Balerion to King's Landing set off riots in the city. Prior to Maegor's wedding to Tyanna of the Tower, Visenya flew upon Vhagar to Driftmark to convince Alyssa Velaryon to appear at the wedding. When the Faith Militant continued to resist Maegor's reign, even after the losses they suffered at the Battle of Stonebridge and the Battle at the Great Fork of the Blackwater, Visenya mounted Vhagar and burned the seats of House Blanetree, House Terrick, House Deddings, House Lychester, and House Wayn in the Riverlands within a single night. Maegor flew Balerion to the westerlands, burning the seats of House Broom, House Doggett, House Falwell, House Lorch, House Myatt, and other pious lords who had defied his royal summons. In 43 AC, Maegor and Visenya turned towards Oldtown, threatening to incinerate the Starry Sept in response to the High Septon's condemnation of his polygamous marriages. Only the mysterious death of the High Septon, which allowed Lord Martyn Hightower to open his gates before Balerion and Vhagar, saved the city from dragonflame. Visenya died on Dragonstone in 44 AC, leaving Vhagar without a rider. Vhagar remained unridden for twenty-nine years after Visenya's death, spending much of that time on Dragonstone and later taking residence in the Dragonpit in King's Landing. It was in 73 AC that Prince Baelon the Brave after achieving knighthood, set out to follow his brother Prince Aemon and become a dragonrider claiming Vhagar. Vhagar along with Caraxes and Vermithor burned the Dornish fleet that attempted to invade the Stormlands during the Fourth Dornish War in 83 AC. After the death of Balerion of old age in 94 AC, Vhagar became the last of the three Targaryen dragons who had fought in the Conquest. Vhagar became riderless again, when Prince Baelon passed away in 101 AC. Vhagar's next known rider was Lady Laena Velaryon, who had become a dragonrider before the age of twelve. According to the maester at Driftmark, the seat of House Velaryon, Laena loved to fly. When Laena wed Prince Daemon Targaryen in 115 AC, they flew upon their dragons across the narrow sea to Pentos, Volantis, Qohor, and Norvos. Everywhere they went, huge crowds came to catch a glimpse of Vhagar and Caraxes, Daemon's dragon. After Laena gave birth in 116 AC, Daemon brought both his own dragon and Vhagar back to Westeros. Laena and Daemon grew close with Daemon's niece, Rhaenyra Targaryen, and the three often flew together upon their dragons, Vhagar, Caraxes, and Syrax. Laena died early in 120 AC. It is said that Laena attempted to reach Vhagar in her final hour as to fly one last time, but she did not have the strength. Following Laena's funeral on Driftmark, the ten-year old prince Aemond Targaryen claimed Vhagar as his own dragon. By 129 AC, Vhagar had grown nearly as big as Balerion had been during Aegon's Conquest, and had become the largest living dragon of her time. Prince Aemond flew on Vhagar to Storm's End, so they could win the support of Lord Borros Baratheon for King Aegon II Targaryen. There Aemond met with Prince Lucerys Velaryon, at Storm's End hoping to gain support for his mother Queen Rhaenyra Targaryen. Aemond was forbidden from attacking Lucerys while both were in Borros's castle, but was allowed to follow him outside. After Lucerys rose into the sky on his dragon Arrax, Aemond mounted Vhagar and followed the young prince. The two dragons fought during a great storm over Shipbreaker Bay, and Vhagar quickly overcame Arrax, whose severed head would wash ashore days later, along with the corpse of Lucerys. Aemond would continue to fly Vhagar in battle during the civil war between King Aegon II and Queen Rhaenyra. During the battle at Rook's Rest, Vhagar and Aemond, and King Aegon and Sunfyre, ambushed the dragon Meleys and her rider Princess Rhaenys Targaryen. Meleys was an old and large dragon, and might have stood a chance against Vhagar alone, but died from the combined assault. Vhagar was the only dragon who left the battle reasonably unharmed. The battle against Meleys left Aegon II severely injured, leaving him incapable of rule, and Prince Aemond was appointed regent. Aemond decided that the main threat in the war was Prince Daemon Targaryen, who was massing armies at Harrenhal. Aemond took Vhagar and most of the green forces from King's Landing north to attack Harrenhal, leaving King's Landing with very little defense. When Aemond and Vhagar arrived at Harrenhal, they found the castle undefended and empty, as Daemon had left some time before to attack King's Landing, after having lured Aemond and Vhagar away from the capital. After the Fall of King's Landing, Prince Aemond and Hand of the King Criston Cole no longer agreed on how to proceed during the war. Aemond took Vhagar on a one-man war of revenge. They burned much of the riverlands, starting with every wooden structure in Harrenhal. Vhagar caused more destruction than an entire army, and severely harmed Rhaenyra's supporters in the riverlands - though Aemond's decision to abandon the army under Criston proved to a strategic blunder. Without Vhagar to protect them, Cole's army in the east was later surrounded and destroyed in the Butcher's Ball, leaving the east wide open to Rhaenyra's forces. About the same time of the Butcher's Ball, Ser Byron Swann and his squire set out to slay a dragon. According to Grand Maester Munkun, Byron was killed in an attempt to slay Vhagar, in an effort to end Aemond's raids across the riverlands. However, this claim is disputed, being instead more probable that Byron tried to kill Rhaenyra Targaryen's dragon Syrax. Aemond and Vhagar continued the destruction of the riverlands and they became the terror of the Trident. Daemon Targaryen, on his dragon Caraxes, and the dragonseed Nettles, on the dragon Sheepstealer, were sent to hunt Aemond. They were allowed to use Maidenpool as their base, as Lord Manfryd Mooton feared an attack from Vhagar, and found himself safer this way. Daemon and Nettles unsuccessfully searched together for Vhagar, who continued to terrorize the riverlands. After the First Battle of Tumbleton, Daemon had word sent out that he and Caraxes would await Aemond and Vhagar at Harrenhal. On the fourteenth day of Daemon's vigil at Harrenhal, Vhagar appeared in the sky, carrying Aemond and his lover Alys Rivers. Aemond left Alys in the castle's yard, and both dragons and their riders launched into the air. All four were killed in the ensuing Battle Above the Gods Eye, when the dragons locked together, Caraxes's jaws closed around Vhagar's neck, Daemon leapt from his dragon to Vhagar to put Dark Sister through Aemond's eye, and the dragons crashed into the lake. Some years after the end of the Dance, Vhagar's body was recovered, with Aemond's armored bones still chained to the saddle. Vhagar was one hundred and eighty-one years old when she died, on the twenty-second day of the fifth moon of 130 AC.Along with eighteen other Targaryen dragon skulls, Vhagar's skull hung on a wall in the Red Keep's throne room. After Robert's Rebellion, King Robert I Baratheon had the skulls removed from the throne room, and stored them in a dank cellar. In 284 AC, when Tyrion Lannister visited the capital for the wedding of his sister Cersei to Robert, he observed the skulls in the cellar, including Vhagar's. In 298 AC, Arya Stark encountered the dragon skulls while passing through the Red Keep cellars. In 299 AC, Daenerys Targaryen had the three ships sent to her by Illyrio Mopatis renamed Vhagar, Meraxes, and Balerion, to tell the world that the dragons had returned.",
        "image": "/images/Vhagar.jpg"
    },
    {
        "name": "Viserion",
        "hatched": "In 299 AC, Dothraki Sea.",
        "died": "Alive",
        "rider": "Owened by Daenerys Targaryen.",
        "colors": "scales are cream, but his horns, wing bones and spinal crest are gold colored. Teeth are shining black daggers. Claws are black and sharp. Eyes are two pools of molten gold, and his flame is pale gold shot through with red and orange.",
        "discription": "Viserion is one of the dragons born in the Dothraki Sea, along with Drogon and Rhaegal. Commanded by Queen Daenerys Targaryen, he is named for her brother, Prince Viserys Targaryen. Viserion has a roar that would send a hundred lions running. Although his true color is cream, he is often referred to as the white dragon. He knows his name. Wisps of smoke emit from his nostrils. When wounded, his blood glows gold and red. ",
        "history": "At the wedding of Daenerys Targaryen to Khal Drogo, she receives multiple bride gifts, including three petrified dragon eggs from Magister Illyrio Mopatis. Viserion's egg is colored pale cream streaked with gold. The maegi Mirri Maz Duur proclaims that in order to bring new life one has to give life. Daenerys burns Drogo's body, along with Mirri Maz Duur herself and the three eggs, birthing Viserion, along with his brothers, Drogon and Rhaegal. When Daenerys calls her people together and mounts her silver mare, she is wearing her lion pelt, and has Viserion on her shoulder. He sinks his sharp black claws into the lion's mane, and coils his tail around her arm, as she gives the order for her khalasar to follow the Red Comet. When Daenerys arrives in Qarth, Viserion and the other dragons are a marvel in the ancient city. When Daenerys receives the news of the death of King Robert Baratheon, the Usurper, Viserion is on her shoulder. He flaps wings the color of cream, stirring the air. Viserion is about the size of a small dog. At Astapor, when Daenerys has the Unsullied attack their former masters, Irri frees Viserion to attack the Good Masters. Viserion is fond of the sellsword captain Ben Plumm, and sometimes lands on Plumm's shoulder. While in Meereen, Viserion and the other dragons misbehave and start to grow wild. Viserion sets Reznak mo Reznak's tokar on fire. As Daenerys walks out onto the terrace of the Great Pyramid, Viserion senses her disquiet, as she is concerned about the Sons of the Harpy. She finds him lying coiled around a pear tree, with his head resting on his tail. She watches Viserion take off and fly in widening circles, until he is lost to her sight beyond the muddy waters of the Skahazadhan. When Drogon kills a young girl outside Meereen, Daenerys has Viserion and Rhaegal confined and chained in the Great Pyramid in a makeshift dragon pit beneath the city. Daenerys leads Viserion down to the pit herself and shuts him up inside with several oxen. After gorging himself and falling asleep, he is chained. Daenerys is later escorted by Ser Barristan Selmy to the Great Pyramid’s pit to visit the dragons. She recalls that not long ago he had ridden on her shoulder, with his tail coiled around her shoulder, and she had fed him morsels of charred meat from her hand. When speaking with Daario Naharis later, she thinks to herself that Viserion and Rhaegal are growing more savage every day. When Daenerys takes Prince Quentyn Martell to see her dragons she notices that Viserion has shattered one chain and melted the others. He clings to the roof of the pit like some huge white bat, his claws dug deep into the burnt and crumbling bricks. After Daenerys disappears on Drogon's back, Prince Quentyn attempts to steal a dragon after enlisting the help of the Windblown. Quentyn realizes that Viserion is in the process of making a cave in the brick big enough to sleep in. Viserion appears and is first attracted to Pretty Meris, as he is looking for Daenerys. Quentyn tries to tame him, but a crossbowman of the Brazen Beasts fires a quarrel at Viserion and is then killed by the dragon. Quentyn attempts to dominate Viserion with a whip. Unbeknownst to Quentyn, however, Rhaegal is behind him. The green dragon looses his fire and fatally burns Quentyn. In the aftermath the iron doors are left open and the two dragons escape. Viserion makes his lair in the pyramid of Uhlez. Sometime thereafter, while on the terrace of the Great Pyramid, Ser Barristan espies pale wings moving above a distant line of eastern hills beyond the city walls. As the Second Siege of Meereen begins, Viserion and Rhaegal are both drawn to the battle. Viserion flies above the battle being fought beneath the city. After donning his armor, Tyrion Lannister steps out of his tent and sees some of the Second Sons gawking at the white dragon above. The Wicked Sister is sending corpses through the sky, and some are bursting into flame as Viserion seeks to devour them. Some of the aflame corpses fall to the ground, causing Yunkish horsemen to catch fire, spreading terror and panic. By the time Ben Plumm comes back from his meeting with Malazza, the Girl General, Viserion has flown back to its lair atop the pyramid of Uhlez. ",
        "image": "/images/Viserion.jpg"
    }
]